{"id":10348,"date":"2021-10-29T11:55:41","date_gmt":"2021-10-29T00:55:41","guid":{"rendered":"https:\/\/www.salesian.vic.edu.au\/?p=10348"},"modified":"2021-10-29T12:02:18","modified_gmt":"2021-10-29T01:02:18","slug":"covid-19-updates","status":"publish","type":"post","link":"https:\/\/www.salesian.vic.edu.au\/2021\/10\/covid-19-updates\/","title":{"rendered":"COVID-19 Updates"},"content":{"rendered":"<div><\/div>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-10808 img-fluid\" src=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/07\/COVID_Blog.jpg\" alt=\"\" width=\"1484\" height=\"952\" srcset=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/07\/COVID_Blog.jpg 1484w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/07\/COVID_Blog-300x192.jpg 300w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/07\/COVID_Blog-1024x657.jpg 1024w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/07\/COVID_Blog-768x493.jpg 768w\" sizes=\"(max-width: 1484px) 100vw, 1484px\"><\/p>\n<p><strong>COVID-19 Update – Friday 29 Octboer 2021<br>\n<\/strong><br>\nThe Victorian Government has announced the easing of restrictions from 6:00pm on Friday 29 October, given the early achievement of the 80 per cent vaccination target.<\/p>\n<p>I am excited that we will soon be able to return all students back to the Bosco campus as of Wednesday 3 November for face-to-face learning.<\/p>\n<p><strong>Recommencing holistic learning opportunities<\/strong><\/p>\n<p>As important, Salesian College will be able to recommence a range of activities, consistent with community settings and school vaccination requirements. This means that from Wednesday 3 November, our school will be able to:<\/p>\n<ul>\n<li>hold graduations, liturgies and other assemblies consistent with community density limits<\/li>\n<li>travel across Victoria for camps and excursions<\/li>\n<li>resume interschool activities such as sport and debating<\/li>\n<li>deliver the full range of curriculum programs, including music and performing arts<\/li>\n<li>conduct transition programs for Year 6 students transitioning to Year 7 in 2022<\/li>\n<li>have a range of visitors on site, including photographers and guest speakers.<\/li>\n<\/ul>\n<p><strong>Professional Practice Day<\/strong><\/p>\n<p>Whilst the government announcement return date is for Monday 1 November, Salesian College will maintain the planned Professional Practice Day to allow our teaching staff the opportunity to plan targeted lessons to improve student learning outcomes.<\/p>\n<p><strong>Minimising the risk of COVID-19 transmission<\/strong><br>\nIt is imperative that as students return to onsite learning, the requirements that have been put in place to minimise the risk of COVID-19 transmission are strictly followed, with a focus on the ‘three Vs’ of vaccination, ventilation and vital COVID Safe steps.<\/p>\n<p>At Salesian, these steps include:<\/p>\n<ul>\n<li>all workers and visitors on site meet the current vaccination requirements<\/li>\n<li>maximising external air flow and good ventilation in all learning environments<\/li>\n<li>proper wearing of face masks indoors<\/li>\n<li>implementing strategies to sperate the mixing of student cohorts<\/li>\n<li>maintaining physical distancing between staff and, where possible, students<\/li>\n<li>maintaining strong hygiene practices, including access to sanitiser and regular cleaning schedules<\/li>\n<\/ul>\n<p>Ahead of students resuming full-time onsite learning from Wednesday 3 November, the College will continue to provide access to onsite learning for classes not yet on site, in line with the staged reopening plan.<\/p>\n<p><strong>Face-to-face teaching<\/strong><\/p>\n<p>From next Wednesday 3 November the College will only provide face-to-face teaching to deliver the curriculum.<\/p>\n<p>Each boy returns from remote learning at different stages of learning. St. Paul teaches us to listen and meet people at their needs, to be humble and kind; teachers will do the same to support your son.<\/p>\n<p>Learning brings hope. In a Catholic school that hope is based on the experience of God’s<\/p>\n<p>love and care for all. It is my hope that from Wednesday 3 November our students will enjoy re-establishing relationships in the classroom with his teachers and peers. Likewise, the opportunity to gather as a community for liturgy, reflection, and celebration will bring much joy to the Salesian community in coming weeks.<\/p>\n<p>Take care.<\/p>\n<p>Kind Regards,<\/p>\n<p><strong>Mark Ashmore<br>\n<\/strong>Principal<\/p>\n<p><strong><br>\nCOVID-19 Update – Monday 6 August 2021 <\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>VCE Exam preparation packs will be available to be collected from the College from Thursday 9 September – Saturday 11 September<\/li>\n<li>The Victorian Government has provided a dedicated vaccine appointment booking hotline for Year 12 students, their teachers and VCE exam supervisors and assessors.<\/li>\n<\/ul>\n<p><strong>Exam Preparation Packs<\/strong><\/p>\n<p>In support of our VCE students’ learning, practice exam packs will be available for all VCE students to collect from College Reception during the following times.<\/p>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<ul>\n<li dir=\"auto\">Thursday 9 September: 11:00 AM – 4:00 PM<\/li>\n<li dir=\"auto\">Friday 10 September: 8:00 AM – 4:00 PM<\/li>\n<li dir=\"auto\">Saturday 11 September: 9:30 AM – 11:00 AM<\/li>\n<\/ul>\n<\/div>\n<div dir=\"auto\">\n<p>Although Practice and Trial Exams will be conducted remotely, it still is a compulsory requirement for these to be completed, so that constructive feedback can be received and gaps in knowledge highlighted. This form of revision is the best form of preparation for the VCAA exams.<\/p>\n<p><strong>Trial Exams<\/strong> are to be completed during <u>Week 1 of the term break<\/u>, one per day according to the Unit 3&amp;4 Exam Preparation Program (included in each pack).<\/p>\n<p>Students can return their completed exam papers to the folder they came in to College reception during the following timeslots:<\/p>\n<p>Sunday 26 September: 3.00 PM – 5.00 PM<\/p>\n<p>Monday 27 September: 8:00 AM – 12.00 PM<\/p>\n<p>Please do not return question books and\/or blank lined paper.<\/p>\n<p><strong>COVID-19 Priority Vaccination Program<\/strong><\/p>\n<\/div>\n<p>To help support the safe conduct of end-of-year exams, the Victorian Government has announced a vaccination blitz for final year students (all Victorian Certificate of Education (VCE) Units 3\/4 students, final year Victorian Certificate of Applied Learning (VCAL) and International Baccalaureate (IB) students), their teachers and exam supervisors and assessors.<\/p>\n<p>From Tuesday 7 September and until Friday 17 September, final year students, their teachers and VCE exam supervisors and assessors will have access to priority timeslots to attend their vaccination appointment at a vaccination centre. The dedicated appointment booking hotline is<strong> 1800 434 144. <\/strong><\/p>\n<p>The hotline will operate from 8am to 8pm. Year 12 students will be able to book from 8 am Monday 6 September.<\/p>\n<p><strong>COVID-19 Update – Thursday 2 August 2021 <\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>As per the Premier’s announcement, we will not be returning to on-site learning this term<\/li>\n<li>The College will run VCE exam preparation sessions in the last two weeks of term<\/li>\n<li>A priority vaccination program for Year 12 students and teachers will run from 7 to 17 September<\/li>\n<li>The GAT has been postponed to Tuesday 5 October<\/li>\n<\/ul>\n<p><strong>Lockdown Extension<\/strong><\/p>\n<p>Yesterday we learnt we will not return to onsite learning in Term 3 and that a plan for Term 4 will be announced at a later date by the Premier. In addition to normal lessons and SACs, we plan to conduct a series of activities in the last two weeks of term to assist our VCE students with preparations for the end of year exams.  I am pleased to say that we have prepared two plans: one for on-site, the other for remote learning. We will be fine-tuning the remote learning version today, ready for distribution tomorrow.<\/p>\n<p><strong>Vaccination Program<\/strong><\/p>\n<p>It was also announced that, from Tuesday 7 September to Friday 17 September, the Victorian Government will put in place a priority vaccination program for Year 12 students in advance of the VCAA exams.<\/p>\n<p>We are not aware whether the Government intends to make participation in the vaccination program mandatory, or if schools will be asked to play a role in its implementation.<\/p>\n<p>As part of this program, Year 12 students will be given priority booking access at state-run clinics, as will teachers and those supervising exams. I am further informed that students and teachers will need to book an appointment, as walk-ups will not be available.<\/p>\n<p>I understand that students and teachers will be able to book one of these priority appointments from Monday 6 September.  It is not clear, at this stage, how the booking system will operate. We will continue to keep the College community informed.<\/p>\n<p><strong>The General Achievement Test (GAT) <\/strong><\/p>\n<p>The Premier also announced that the General Achievement Test (GAT) will be postponed to Tuesday 5 October (i.e. the second day of Term 4.)<\/p>\n<p>We encourage all VCE and VCAL students to:<\/p>\n<ul>\n<li>Divide each day into short chunks and work through each piece of the day purposefully<\/li>\n<li>Get plenty of good food, sleep and exercise<\/li>\n<li>Remain connected with their friends both in and out of class<\/li>\n<li>Understand that every other VCE and VCAL student in the state is in the same situation.<\/li>\n<\/ul>\n<p>Please contact the College if we can be of any assistance in any matter relating to your education or wellbeing.<\/p>\n<p><strong>Mr Neil Carter<\/strong><br>\nPrincipal<\/p>\n<p> <\/p>\n<p><strong>COVID-19 Update – Friday 27 August 2021<\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>To support students’ learning and wellbeing, we are making <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2021\/09\/Remote-Learning-Updates_V4.pdf\">several changes to our remote learning processes<\/a> for Years 7-11 classes<\/li>\n<li>The Year 12 program structure will not change<\/li>\n<li>The changes will come into effect on Tuesday 31 August<\/li>\n<\/ul>\n<p><strong>Oratory Classes:<\/strong><\/p>\n<ul>\n<li>No Oratory classes Pd. 1 Monday and Friday<\/li>\n<li>Boys meet their Oratory Leaders at 9.25am on Monday and Fridays to:\n<ul>\n<li>Greet each other and start the school day<\/li>\n<li>Complete wellbeing check ins<\/li>\n<\/ul>\n<\/li>\n<li>Monday morning Staff Briefing starts at 9.15am<\/li>\n<\/ul>\n<p><strong>Game Time: <\/strong><\/p>\n<ul>\n<li>Pd. 2 will finish at 10.30am each day giving 40 minutes for Recess<\/li>\n<li>Boys will be strongly advised to spend 20 minutes:\n<ul>\n<li>Outside playing a game or getting some form of physical activity<\/li>\n<li>Playing a game with friends or family (in person or online)<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><strong>Independent Learning Activity<\/strong><\/p>\n<ul>\n<li>One 40 or 80 minute lesson (at teacher’s discretion) per subject each week is designated for an Independent Learning Activity (ILA)<\/li>\n<li>The ILA:\n<ul>\n<li>relates to the topic<\/li>\n<li>requires the student to take responsibility for his learning<\/li>\n<li>could be consist of drawing, reading, simple craft work, data gathering, item collection, journal writing etc<\/li>\n<li>must not rely on laptops, phones etc<\/li>\n<\/ul>\n<\/li>\n<li>Will be outlined in simple terms by the teacher and lodged on SIMON so as to be accessible to parents.<\/li>\n<\/ul>\n<p><strong>COVID-19 Update – Thursday 12 August 2021<\/strong><\/p>\n<ul>\n<li>The calendared Professional Practice Day has been postponed to Wednesday 18 August<\/li>\n<li>Don Bosco’s Oratory Week has been postponed to the week beginning Monday 6 September<\/li>\n<li>The GAT will be rescheduled to a date to be determined<\/li>\n<li>We detail Year 12 SACs for Week 6<\/li>\n<li>Year 12 Exam preparation will be taking place remotely next week<\/li>\n<li>Boys who are vulnerable or are children of essential workers and require onsite supervision must be registered<\/li>\n<\/ul>\n<p><strong>Professional Practice Day<\/strong><\/p>\n<p>Friday 13 August is calendared as a Professional Practice Day.  In essence, this is a catch up day for the boys and a preparation\/correction day for teachers. I had hoped to defer this until Term 4 in the event that face to face to teaching resumed on this date. With this plan scuppered, we will now hold the Professional Practice Day on <strong>Wednesday 18 August<\/strong>. This date has been chosen as:<\/p>\n<ul>\n<li>Students and staff need a break from computer screens<\/li>\n<li>Wednesdays have the fewest timetabled classes, especially for VCE students<\/li>\n<li>It avoids the need to hold a Professional Practice Day on an ‘at school’ day once we resume face to face lessons.<\/li>\n<\/ul>\n<p>Consequently, there will be <strong>no lessons on Wednesday 18 August<\/strong>.  The only official school activity on this day will be the Unit 4 Specialist Maths SAC which will take place during Study Hall as scheduled.<\/p>\n<p>I will be in touch with the boys early next week with some further advice about how they should use this day.<\/p>\n<p><strong>Don Bosco Oratory Week<\/strong><\/p>\n<p>This is always one of the highlights of the school year.  We had already pushed the week back due to earlier lockdowns.  We had planned to run an abbreviated version of the program in the week beginning Monday 23 August.  We will now defer these activities to the week beginning <strong>Monday 6 September.<\/strong><\/p>\n<p><strong>Year 12 Matters<\/strong><\/p>\n<p><em>GAT<\/em><\/p>\n<ul>\n<li>The General Achievement Test (GAT) will be rescheduled to a date to be determined.<\/li>\n<\/ul>\n<p><strong>Year 12 SAC Schedule Week 6 (16 – 20 August)<\/strong><\/p>\n<ul>\n<li>Speciality Maths (Wednesday Study Hall remotely)<\/li>\n<li>Economics (in class remotely)<\/li>\n<li>Legal Studies (in class remotely)<\/li>\n<li>Studio Arts (Friday Study Hall remotely)<\/li>\n<li>Accounting (Friday Study Hall remotely)<\/li>\n<li>Physical Education (in class remotely)<\/li>\n<\/ul>\n<p><strong>Year 12 Exam Preparation Program<\/strong><\/p>\n<p>The Exam Preparation Program will be taking place remotely next week. Please note that this takes the place of the Oratory\/RE program.  A number of special activities including ‘Masterclasses’  Participation in the Exam Preparation Program is compulsory. If students are not in a Masterclass they are expected to continue self-directed exam preparation.<\/p>\n<p>A reminder that the trial exams in the Term 3 holidays are also compulsory. This year, we are also offering the opportunity for Year 12 students to study at school in the library during school hours.<\/p>\n<p><strong>Children of Essential Workers \/ Vulnerable Children<\/strong><\/p>\n<p>Boys who may be vulnerable or are children of essential workers and who require onsite supervision at school must be registered via completion of the following form.<\/p>\n<p><a href=\"https:\/\/forms.office.com\/r\/bgAuzwZSkJ\">https:\/\/forms.office.com\/r\/bgAuzwZSkJ<\/a><\/p>\n<p>Finally, I hope that you and your family are doing as well as can possibly be expected.  Please let me, the relevant Year Level Coordinator or Dean know of any concerns you may have regarding your son’s education or wellbeing.<\/p>\n<p>God bless,<\/p>\n<p><strong>Mr Neil Carter<\/strong><br>\nPrincipal<\/p>\n<p><strong>COVID-19 Update – Thursday 05 August 2021 <\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>Lockdown from Thursday 5 August to Thursday 12 August<\/li>\n<li>Planning for a return to on-campus learning on Friday 13 August<\/li>\n<li>School will be closed to all students, except those who are vulnerable or the sons of authorised workers<\/li>\n<li>Students on Year 8 Camp will return to the College as planned at 1:00pm on Friday 6 August<\/li>\n<\/ul>\n<p>The Premier has announced that we will be in <strong>lockdown from 8:00pm tonight until next Thursday evening.<\/strong>  Hopefully, we will be able to return to school on Friday, 13 August. School will be closed for all students except those who are vulnerable, or, who are the sons of authorised workers (please see the information in italics below if you feel this may be relevant for your family.)<\/p>\n<p>We have received advice that the<strong> Year 8 Camp at Phillip Island<\/strong> can proceed until its designated end. Accordingly, boys and staff currently on the Year 8 Camp will complete the program and return to the College at <strong>approximately 1.00pm tomorrow<\/strong>. The boys will be able to go to their lockers to pick up their learning resources before heading home.<\/p>\n<p>Please note that, as was the case in our most recent lockdown, our aim is to make the remote teaching and learning process consistent for students and as similar as possible to our normal school environment. We will continue to do this by having our teachers use the various functions on Microsoft Teams so that boys:<\/p>\n<ul>\n<li>Are monitored throughout lessons so they keep on task<\/li>\n<li>Can work in groups with fellow students.<\/li>\n<\/ul>\n<p>We remind boys that they are expected to:<\/p>\n<ul>\n<li>Ensure they have all learning resources in their possession<\/li>\n<li>Make sure they have a suitable study space (desk, table and chair)<\/li>\n<li>Are dressed appropriately<\/li>\n<li>Punctually attend all scheduled classes on Microsoft Teams<\/li>\n<li>Switch on their cameras on and mute microphones in all lessons unless engaged in responding to question or engaged in discussion<\/li>\n<li>Complete and submit all set work as instructed by the teacher<\/li>\n<li>Act on any feedback given to improve learning outcomes<\/li>\n<li>Uphold the same standards of conduct and behaviour during classes as would be expected at school<\/li>\n<li>Ask for teacher help on Microsoft Teams or via email as needed<\/li>\n<\/ul>\n<p><strong>Parents and guardians are asked to:<\/strong><\/p>\n<ul>\n<li>Ensure their son have all their books and resources needed to complete their remote learning<\/li>\n<li>Encourage their son to be actively involved in remote learning<\/li>\n<li>Ensure their son has a suitable study space to complete their remote learning (quiet space, desk, table, chair)<\/li>\n<li>Support their son in establishing a structured day- start, finish and break times in line with their published school timetable<\/li>\n<li>Support their son’s wellbeing by encouraging physical exercise and maintaining a proper sleep routine<\/li>\n<li>Support their son to submit their work as directed by their teachers<\/li>\n<li>Encourage their son to act on any feedback given to improve their learning.<\/li>\n<\/ul>\n<p>Our Continuity of Learning suite of infographics to support student learning and wellbeing can be found <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2021\/06\/Salesian_Continuity-Learning_2021-Suite-Final-Students-Parentsv2.pdf\">here. <\/a><\/p>\n<p>As was the case in previous lockdowns, some of our students may be eligible to be come into school during the lockdown period. Information for families which may be in this situation appears below in italics.<\/p>\n<p>If you have particular concerns about your son’s mental or academic wellbeing, can I please ask that you contact us at your earliest opportunity. I will be asking our staff to do likewise if they are worried about a student’s progress.<\/p>\n<p>I would like to wish you and your family every best wish for the coming week.<\/p>\n<p>God bless,<\/p>\n<p><strong>Neil Carter<\/strong><br>\nActing Principal<\/p>\n<p><em>Criteria for On-Site Supervision of Students<\/em><\/p>\n<ul>\n<li><em>If you are an authorised worker who cannot work from home and supervise your child<\/em><\/li>\n<li><em>If the student is in out of home care<\/em><\/li>\n<li><em>If the student has been deemed by Child Protection and\/or Family Services to be at risk of harm<\/em><\/li>\n<li><em>If the student has been identified by the school as vulnerable (including via referral from a family violence agency, homelessness or youth justice service, or mental health or other health service).<\/em><\/li>\n<\/ul>\n<p><em>Families who wish to access supervision need to contact the College on 9807-2644 to speak to one of the Dean of Students (Byron Chen for boys in Years 7-9 or Kim Beurs for students in Years 10-12.)<\/em><\/p>\n<p><em>Protocols for supervision at school:<\/em><\/p>\n<ul>\n<li><em>Boys may wear casual clothes<\/em><\/li>\n<li><em>Boys must sign in through Student Reception at the beginning of the day, and before leaving at the end of day<\/em><\/li>\n<li><em>Boys must bring their own food and a water bottle<\/em><\/li>\n<li><em>Boys will have a normal day’s timetable and do their work on Microsoft Teams<\/em><\/li>\n<li><em>Boys will be dismissed at the usual end of the day<\/em><\/li>\n<\/ul>\n<p><em>If you believe your son qualifies to the criteria for on site supervision, please fill in <a href=\"https:\/\/forms.office.com\/Pages\/ResponsePage.aspx?id=UgtQB4udKEeKfjYa7B8HvQKUvRie1uhGiq81rRuGEXVUOU03QVZBM0RKSjIwUkFVODA2MkVQMU1VSy4u\">this Microsoft Form<\/a> as soon as possible. <\/em><\/p>\n<p> <\/p>\n<p><strong>COVID-19 Update – Tuesday 27 July 2021 <\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>School will resume for all students from Wednesday 28 July<\/li>\n<li>It is important for all students to have all school work completed in readiness for the return to school<\/li>\n<li>Boys are asked to wear their uniform correctly and to remember their face masks<\/li>\n<li>We provide an update on the status of upcoming events<\/li>\n<li>Students in quarantine will be supported in their learning by the College<\/li>\n<li>The GAT will take place on Thursday 12 August<\/li>\n<li>Subject Selection web preferences have been extended until Monday 2 August<\/li>\n<li>The Canteen and charter buses will run as per normal<\/li>\n<\/ul>\n<p>Welcome back, boys! It will be great to see the boys back at the College, where they belong.<\/p>\n<p>It is important for boys to:<\/p>\n<ul>\n<li>Get their school work up to date tonight in readiness for tomorrow<\/li>\n<li>Approach tomorrow, the rest of the week and the remainder of the term with a really positive attitude<\/li>\n<li>Genuinely value their friends, teachers and the facilities that are provided for them<\/li>\n<li>Wear their uniform correctly and be clean shaven<\/li>\n<li>Wear their face masks properly<\/li>\n<\/ul>\n<p><strong>Coming Events<\/strong><\/p>\n<table>\n<tbody>\n<tr>\n<td width=\"33%\"><strong>Event<\/strong><\/td>\n<td width=\"20%\"><strong>Date<\/strong><\/td>\n<td width=\"46%\"><strong>Status<\/strong><\/td>\n<\/tr>\n<tr>\n<td width=\"33%\">House Cross Country Carnival<\/td>\n<td width=\"20%\">Friday 30 July<\/td>\n<td width=\"46%\">To be confirmed.  Awaiting health advice<\/td>\n<\/tr>\n<tr>\n<td width=\"33%\">Casual Clothes Day<\/td>\n<td width=\"20%\">Friday 30 July<\/td>\n<td width=\"46%\">Will proceed if Cross Country is postponed<\/td>\n<\/tr>\n<tr>\n<td width=\"33%\">Drive to Aspire Fundraising Event<\/td>\n<td width=\"20%\">Friday 30 July<\/td>\n<td width=\"46%\">Postponed<\/td>\n<\/tr>\n<tr>\n<td width=\"33%\">Year 9 Outdoor Ed Excursion<\/td>\n<td width=\"20%\">Friday 30 July<\/td>\n<td width=\"46%\">Postponed<\/td>\n<\/tr>\n<tr>\n<td width=\"33%\">Year 9 Positive Relationships Forum<\/td>\n<td width=\"20%\">Monday 2 August<\/td>\n<td width=\"46%\">Will now take place on Thursday 18 November<\/td>\n<\/tr>\n<tr>\n<td width=\"33%\">Year 8 Camp<\/td>\n<td width=\"20%\">Week beginning Monday 2 August<\/td>\n<td width=\"46%\">Going ahead<\/td>\n<\/tr>\n<tr>\n<td width=\"33%\">Year 8 Experiential Activities<\/td>\n<td width=\"20%\">Week beginning Monday 2 August<\/td>\n<td width=\"46%\">Some modified activities may be held if the Camp proceeds<\/td>\n<\/tr>\n<tr>\n<td width=\"33%\">Gold Coast Music Tour<\/td>\n<td width=\"20%\">Wednesday 11 August<\/td>\n<td width=\"46%\">Going ahead at this stage<\/td>\n<\/tr>\n<tr>\n<td width=\"33%\">Year 12 Formal<\/td>\n<td width=\"20%\">Thursday 12 August<\/td>\n<td width=\"46%\">Going ahead at this stage. Mrs Rabot is endeavouring to find an alternative date if this date is not possible<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p><strong>Students in Quarantine<\/strong><\/p>\n<p>Students who are required to remain in quarantine will continue to be supported in their learning. Students who are required to continue learning remotely, are asked to follow the school timetable and sign in via Microsoft Teams. An email to the boys concerned, containing details and instructions on how to access classes will be sent to the boys from IT this afternoon.<\/p>\n<p>We ask that affected families remain in close contact and provide details regarding their sons return to school.<\/p>\n<p><strong>General Achievement Test (GAT)<\/strong><\/p>\n<p>Please be aware that all students who are enrolled in Unit 3&amp;4 subjects will be sitting the VCAA GAT (General Achievement Test) on<strong> Thursday 12 August.<\/strong><\/p>\n<p>The duration of the GAT is 3 hours 15 minutes (10.00 AM-1:15 PM) and is a test of general knowledge and skills in: written communication, mathematics, science and technology, and humanities, the arts and social sciences.<\/p>\n<p>Although the GAT results do not count directly towards a student’s VCE results, they play an important role in checking that school-based assessments and examinations have been accurately assessed, and in calculating Derived Examination Scores when needed.<\/p>\n<p><strong>Details for GAT Day:<\/strong><\/p>\n<ul>\n<li>Students are asked to arrive at the College a<strong>t 9:30 AM<\/strong> and proceed to their designated Oratory classroom<\/li>\n<li>Students are asked to keep their personal possessions in their lockers<\/li>\n<li><strong>Students are required to bring:<\/strong><\/li>\n<li>A set of pens and pencils<\/li>\n<li>Their Salesian ID card<\/li>\n<li>Their VCAA student number<\/li>\n<li>A dictionary<\/li>\n<li>A spare face mask<\/li>\n<li>Students will attend their scheduled period 5 class.<\/li>\n<\/ul>\n<p><strong>Subject Selection<\/strong><\/p>\n<p>Please note that the due date for <strong>web preferences has been extended from Friday 30 July to Monday 2 August<\/strong> <strong>3:00PM.<\/strong><\/p>\n<p><strong>Canteen<\/strong><\/p>\n<p>The Canteen will be open tomorrow as normal.  However, we will be without parent helpers for a few days at least, so boys are asked to be patient and courteous whilst queueing.<\/p>\n<p><strong>Charter Bus<\/strong><\/p>\n<p>Charter Buses will run as per normal.<\/p>\n<p><strong>COVID-19 Update – Friday 16 July 2021<\/strong><\/p>\n<p><strong>Summary<\/strong><\/p>\n<ul>\n<li>Lockdown from midnight Thursday 16 July until midnight Tuesday 20 July<\/li>\n<li>Fast turnaround time from teachers and support staff<\/li>\n<li>New approach to remote teaching and learning<\/li>\n<li>Infographic remote learning plan to be discussed amongst students and families<\/li>\n<\/ul>\n<p>As, announced by the Premier on Thursday 15 July, lockdown will take effect from midnight Thursday 16 July until midnight Tuesday 19 July.  Currently, the return to school schedule is set for Wednesday 21 July.<\/p>\n<p>I would like to thank the teaching staff for their fast turnaround work to prepare for this latest lockdown; where we will be utilising a new approach to remote teaching and learning.  I would also like to thank the support staff for their vital assistance in these difficult times.<\/p>\n<p>It is important to note that we will adopting a different approach to remote learning on this occasion.  Our aim is to make the remote teaching and learning process consistent for all boys and as similar as possible to our normal school environment.  We intend to achieve this by having our teachers:<\/p>\n<ul>\n<li>Use the ‘Gallery View’ and ‘Breakout’ functions on Microsoft Teams (these features are activated by teachers rather than students); and<\/li>\n<li>Monitor student work throughout every part of every lesson to ensure students keep on task.<\/li>\n<\/ul>\n<p><strong>Boys are expected to:<\/strong><\/p>\n<ul>\n<li>Ensure all learning resources are in their possession<\/li>\n<li>A suitable study space (desk, table and chair) is setup<\/li>\n<li>Be dressed appropriately<\/li>\n<li>Punctually attend all scheduled classes on Microsoft Teams<\/li>\n<li>Switch on cameras and mute microphones in all lessons unless engaged in responding to question or engaged in discussion<\/li>\n<li>Complete and submit all set work as instructed by the teacher<\/li>\n<li>Act on any feedback given to improve learning outcomes<\/li>\n<li>Uphold the same standards of conduct and behaviour during classes as would be expected at school<\/li>\n<li>Ask for teacher help on Microsoft Teams or via email as needed.<\/li>\n<\/ul>\n<p><a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2021\/06\/Salesian_Continuity-Learning_2021-Suite-Final-Students-Parentsv2.pdf\">These infographics<\/a> contain precise details of our plan for the current lockdown. All parents \/ guardians are asked to go through this information with students.<\/p>\n<p>Going into a further lockdown, however short it may be, is obviously very disruptive for everyone.  Boys are encouraged to keep focused, try their hardest and treat loved ones well.<\/p>\n<p><strong>Key points emphasised with students:<\/strong><\/p>\n<ol>\n<li>Get plenty of good sleep, exercise and food<\/li>\n<li>Teachers will give regular breaks during the day – use them wisely<\/li>\n<li>Be a good man at home – treat your loved ones well<\/li>\n<li>Follow your teachers’ directions at all times<\/li>\n<li>Cameras on, mics off throughout each and every lesson<\/li>\n<li>Contribute to classes, don’t disrupt them.<\/li>\n<\/ol>\n<p>Doing these things, students will come back to school in good stead.  Boys who choose not to follow Points 4-6 will be worked with to change behaviour.<\/p>\n<p>I would like to wish all students and families every best wish for the coming week.<\/p>\n<p>God Bless,<\/p>\n<p><strong>Mr Neil Carter<br>\n<\/strong>Acting Principal<\/p>\n<p> <\/p>\n<p><strong>COVID-19 Update – Thursday 10 June 2021<\/strong><\/p>\n<p>It was a great relief to hear the news that students in all year levels can resume schooling. It is a little unfortunate that our <strong>Correction Day is scheduled for tomorrow (Friday 11 June).<\/strong>  However, our teachers really need this time to get on top of the assessment which has poured in as the semester came to its conclusion.  It will be absolutely fantastic to welcome <strong>ALL<\/strong> of the boys back to their school <strong>next Tuesday.<\/strong> <strong>Just a reminder that Year 7 boys will have an English exam on Tuesday, whilst boys in Years 8, 9 and 10 will have English and Maths exams on this day.<\/strong><\/p>\n<p>I would like to congratulate our Year 12 boys for the way they have gone about their studies since their return to school. Similarly, our Year 11 students have been diligent in their efforts during their VCE exams which are being conducted this week.<\/p>\n<p>On Friday 18 June, the incoming principal, Mr Mark Ashmore will be visiting the College to meet students and staff.  He will give a short address to the boys via ‘Teams’ and will then go on a tour of the College where he will have the chance to meet people and see the school in operation.  I have already had a number of meetings with Mark briefing him about the College and its operations.  He is very excited about taking up his new role at the start of Term Four.<\/p>\n<p><strong>Mr Neil Carter<br>\n<\/strong>Acting Principal<\/p>\n<p><strong>COVID-19 Update – Wednesday 2 June 2021<\/strong><\/p>\n<p>Dear Parents\/Guardians,<\/p>\n<p>The Chief Health Officer announced earlier today that lockdown has been extended by a further seven days for boys in Years 7 – 10. Years 11 – 12 students (including Year 12 VCAL boys) will return on Friday 4 June.<\/p>\n<p>With Friday 11 June being the Semester 1 Correction Day, all boys should hopefully be able to return to school on Tuesday 15 June.<\/p>\n<p><strong>Health and Safety<\/strong><\/p>\n<ul>\n<li>It is important that we follow all COVID precautions (eg. social distance, wearing masks, stay home if not well etc.)<\/li>\n<\/ul>\n<p><strong>Unit 3 SACs<\/strong><\/p>\n<ul>\n<li>Unit 3 SACs scheduled for Friday 4 – Thursday 10 June will proceed as per the SAC Schedule<\/li>\n<li>The Unit 3 \/ 4 SAC schedule has been rearranged to cater for SACs missed in the current lockdown. This will be forwarded to Unit 3 students as soon as possible<\/li>\n<li>SACs may potentially be re-scheduled for the afternoons of Wednesday 9 June (following GAT) and Pd. 5 on Friday 25 June (last day of term)<\/li>\n<\/ul>\n<p><strong>Exams<\/strong><\/p>\n<ul>\n<li>VCE Unit 1 exams will commence on Friday 4 June and conclude on Friday 11 June<\/li>\n<li>Year 10 boys undertaking a VCE Unit 1 subject must sit the relevant exam<\/li>\n<li>The Library can be used by students pre and post exams for quiet study<\/li>\n<li>Years 7 – 10 boys will not complete Semester One exams except that:\n<ul>\n<li>Year 7 students will have an English exam on Tuesday 15 June<\/li>\n<li>Years 8 – 10 students will have an English \/ Literature and a Maths exam on Tuesday 15 June<\/li>\n<\/ul>\n<\/li>\n<li>For Years 8-10 subjects which will not have an exam, assessment will be weighted evenly across all other remaining assessment tasks<\/li>\n<\/ul>\n<p><strong>Semester 2 Start Date<\/strong><\/p>\n<ul>\n<li>Year 10 Semester 2 will begin on Monday 7 June<\/li>\n<li>Years 7, 8, 9 and 11 Semester 2 will begin on Tuesday 15 June<\/li>\n<\/ul>\n<p><strong>GAT<\/strong><\/p>\n<ul>\n<li>The VCE GAT will take place as scheduled on Wednesday 9 June unless we are advised otherwise by VCAA<\/li>\n<\/ul>\n<p><strong>Correction Day<\/strong><\/p>\n<ul>\n<li>The Correction Day set for Friday 11 June remains as scheduled<\/li>\n<\/ul>\n<p><strong>Reports<\/strong><\/p>\n<ul>\n<li>Semester reports will be available by Monday 28 June at the latest<\/li>\n<\/ul>\n<p><strong>Student Wellbeing<\/strong><\/p>\n<ul>\n<li>We are working on a new ‘Teams’ feature which will enable Oratory Leaders to quickly check in on students to see how they are going. More on this later!<\/li>\n<\/ul>\n<p><strong>Subject Selection<\/strong><\/p>\n<ul>\n<li>The Subject Selection Information Evening scheduled for Tuesday 22 June will proceed in a remote environment<\/li>\n<\/ul>\n<p><strong>Canteen<\/strong><\/p>\n<ul>\n<li>The Canteen will be open Friday 4 June – Thursday 10 June. Please note that there will be no parent helpers, so please be patient.<\/li>\n<\/ul>\n<p><strong>Charter Buses<\/strong><\/p>\n<ul>\n<li>The Charter Buses will operate as usual<\/li>\n<\/ul>\n<p><strong>Postponements\/Cancellation<\/strong><\/p>\n<ul>\n<li>There will not be a Whole School Assembly at the end of term<\/li>\n<li>Oratory Week will be deferred until Term 3, Week 7\n<ul>\n<li>Depending on how things unfold we may\/may not be able to have a full Salesian Festival Day on Friday 27 August<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>I am really looking forward to seeing our Year 11 and 12 boys back at school on Friday and boys in Years 7-10 the week following.  If you have any concerns about how your son is going, can I please urge you to contact his Oratory Leader or Level Coordinator in the first instance?<\/p>\n<p>Best wishes,<\/p>\n<p><strong>Mr Neil Carter<\/strong><br>\nActing Principal<\/p>\n<p><strong>COVID-19 Update – Thursday 27 May 2021 <\/strong><\/p>\n<p>Dear Parents\/Guardians,<\/p>\n<p>As we all now know, the Acting Premier has announced that we will be in lockdown from midnight tonight until next Thursday evening. Hopefully, this step will enable the authorities to get on top of the current COVID outbreak so we can return to school on Friday 4 June. School will be closed for all students except those who are vulnerable, or those who are the sons of authorised workers. Please see the information below if you feel this may be relevant to your family.<\/p>\n<p><strong>Please note that:<\/strong><\/p>\n<ul>\n<li>Tomorrow (Friday 28 May) will be a catch up day for all students and staff.  No lessons will be conducted tomorrow<\/li>\n<li>As was the case last year and earlier this year, we will be lodging lessons on SIMON and using Microsoft Teams to conduct remote classes. Please check <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2021\/05\/Continuity-of-Learning-Plan-Families-002.pdf\">the attached document<\/a> for further details. Students must attend each lesson and complete ‘checkpoints’ as required<\/li>\n<li>Unit 3 SACs scheduled for Monday 31 May – Thursday 3 June will be deferred to dates to be arranged<\/li>\n<li>In the period Monday 31 May – Thursday 3 June:\n<ul>\n<li>Years 10\/11 classes will be either exam revision or Semester 2 work as determined by individual teachers<\/li>\n<li>Years 7-9 classes will be used to finish coursework and\/or prepare for exams<\/li>\n<\/ul>\n<\/li>\n<li>Year 10 exams will be deferred until Friday 4 – Thursday 10 June<\/li>\n<li>Years 7 – 9 exams will be conducted Tuesday 8 – Thursday 10 June<\/li>\n<li>The Professional Practice Day scheduled for Friday 11 June will remain to enable teachers to mark assessment tasks<\/li>\n<li>Oratory Week will be deferred until a later date<\/li>\n<li>There will not be a Whole School Assembly at the end of term<\/li>\n<li>If there are any technical issues, please contact our I.T. staff at the following email address: <a href=\"mailto:support@salesian.vic.edu.au\">support@salesian.vic.edu.au<\/a><\/li>\n<\/ul>\n<p><strong>The below students may be eligible to come into school during the lockdown period:<\/strong><\/p>\n<ul>\n<li>If you are an authorised worker who cannot work from home and supervise your child<\/li>\n<li>If the student is in out of home care<\/li>\n<li>If the student has been deemed by Child Protection and\/or Family Services to be at risk of harm<\/li>\n<li>If the student has been identified by the school as vulnerable (including via referral from a family violence agency, homelessness or youth justice service, or mental health or other health service).<\/li>\n<\/ul>\n<p>Families who wish to access supervision need to contact the College on 9807 2644 to speak to one of the Dean of Students, Byron Chen for boys in Years 7-9, and Kim Beurs for Years 10-12.<\/p>\n<p>Protocols for supervision at school.<\/p>\n<ul>\n<li>Boys may wear casual clothes<\/li>\n<li>Boys must sign in through student reception at the beginning and before leaving at the end of day<\/li>\n<li>Boys must bring their own food and a water bottle<\/li>\n<li>Boys will have a normal day’s timetable and do their work on Microsoft Teams<\/li>\n<li>Boys will be dismissed at the usual end of the day<\/li>\n<\/ul>\n<p>If you believe your son qualifies to the criteria for on site supervision, please fill in <a href=\"https:\/\/forms.office.com\/Pages\/ResponsePage.aspx?id=UgtQB4udKEeKfjYa7B8HvQKUvRie1uhGiq81rRuGEXVUOU03QVZBM0RKSjIwUkFVODA2MkVQMU1VSy4u\">this Microsoft Form<\/a> as soon as possible.<\/p>\n<p>I have <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2021\/05\/Continuity-of-Learning-Plan-Families-002.pdf\">attached our Continuity of Learning Plan<\/a> which contains important additional information. Please take the opportunity to read through this with your son.<\/p>\n<p>Please take care and I hope that you have a good weekend.<\/p>\n<p>Best wishes,<\/p>\n<p><strong>Mr Neil Carter<br>\n<\/strong>Acting Principal<\/p>\n<p><strong>COVID-19 Update – Wednesday 17 February 2021<\/strong><\/p>\n<p data-sr-id=\"4\"><strong>Summary:<\/strong><\/p>\n<ul>\n<li>Restrictions in Victoria lift, as of midnight Wednesday 17 February 2021<\/li>\n<li>School returns Thursday 18 February to onsite learning<\/li>\n<li>Thursday 18 February will follow the normal Day 9 timetable; Athletics Carnival postponed<\/li>\n<li>Masks must be worn indoors and on public transport<\/li>\n<li>SACs and other school assessments scheduled for Thursday will proceed<\/li>\n<\/ul>\n<p>Dear Parents,<\/p>\n<p>As restrictions in Victoria lift, as of midnight 17 February 2021, school can return Thursday 18 February 2021 to onsite learning.<\/p>\n<p>With the postponement of the Athletics Carnival, we will follow the normal Day 9 timetable. Please remember that:<\/p>\n<ul>\n<li>Normal school uniform should be worn (sports uniform tomorrow for boys in Years 7 and 8)<\/li>\n<li>Masks must be worn indoors and on public transport<\/li>\n<li>SACs and other school assessments scheduled for Thursday will proceed<\/li>\n<\/ul>\n<p>Boys are reminded to ensure they get on top of all schoolwork to ensure a positive day back tomorrow.<\/p>\n<p>Looking forward to see you all back at school!<\/p>\n<p>Best wishes,<\/p>\n<p><strong>Mr Carter<\/strong><br>\nActing Principal<\/p>\n<p><strong>COVID-19 Update – Friday 12 February 2021<\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li><strong>Stage 4<\/strong> <strong>Lockdown from midnight Friday 12 February until Thursday evening<\/strong><\/li>\n<li><strong>School will be closed <\/strong>for all students except those who are vulnerable, or, who are the sons of essential workers<\/li>\n<li><strong>Classes will be conducted remotely starting from Pd. 3 on Monday<\/strong><\/li>\n<li>Lessons will be lodged on <strong>SIMON and using Microsoft Teams<\/strong> to conduct remote classes<\/li>\n<li>Information on using SIMON and Teams can be accessed by parents on PAM and \/ or the SIMON Everywhere app, under “Continuity of Learning” in the Daily Messages section<\/li>\n<li>Teachers will be taking the role on SIMON, and attendance is compulsory<\/li>\n<li>There will be no assessment tasks conducted during the lockdown<\/li>\n<\/ul>\n<p>Dear Parents \/ Guardians,<\/p>\n<p>As you may be aware, the Premier has announced that we will be in <strong>Stage 4 Lockdown from midnight tonight, Friday 12 February until midnight Wednesday 17 February.<\/strong>  Hopefully, this step will enable the authorities to get on top of the current COVID outbreak so that we can return to school next Thursday for our House Athletics Carnival.<\/p>\n<p><strong>School will be closed<\/strong> for all students except those who are vulnerable, or, who are the sons of essential workers (please see the information in green text below if you feel this may apply to you. <strong>Classes will be conducted remotely starting from Pd. 3 on Monday<\/strong>.  We are having a late start on Monday to ensure that all boys and staff have ironed out any technical difficulties.<\/p>\n<p>As was the case last year, we will be lodging lessons on <strong>SIMON and using Microsoft Teams<\/strong> to conduct remote classes.  Information on using SIMON and Teams (including short videos) can be accessed by parents on PAM and \/ or the SIMON Everywhere app, they can be found under “Continuity of Learning” in the Daily Messages section. Student have access to this information through their Simon accounts as well. If there are any technical issues, please contact our I.T. staff at the following email address: <a href=\"mailto:support@salesian.vic.edu.au\">support@salesian.vic.edu.au<\/a><\/p>\n<p>Please note that teachers will be taking the role on SIMON, and attendance is compulsory. Boys are expected to be present online during each class and in each meeting on Teams. They must also check off any “check points” that subject teachers set for their lessons.<\/p>\n<p>There will be no assessment tasks conducted during the lockdown.<\/p>\n<p>I have attached our <strong>Continuity of Learning Plan<\/strong> which contains important additional information.  Please take the opportunity to read through this with your son.<\/p>\n<p>Some of our students may be eligible to be come into school during the lockdown period.<\/p>\n<ul>\n<li>If you are an essential worker who cannot work from home and supervise your child<\/li>\n<li>If the student is in out of home care<\/li>\n<li>If the student has been deemed by Child Protection and\/or Family Services to be at risk of harm<\/li>\n<li>If the student has been identified by the school as vulnerable (including via referral from a family violence agency, homelessness or youth justice service, or mental health or other health service).<\/li>\n<\/ul>\n<p>Protocols for supervision at school.<\/p>\n<ul>\n<li>Boys may wear free dress<\/li>\n<li>Boys must sign in through student reception at the beginning and before leaving at the end of day<\/li>\n<li>Boys must bring their own food and a water bottle<\/li>\n<li>Boys will have a normal day’s timetable and do their work on Microsoft Teams<\/li>\n<li>Boys will be dismissed at the usual end of the day<\/li>\n<\/ul>\n<p>If you believe your son qualifies to the criteria for on-site supervision, please fill in the following Microsoft form as soon as possible<\/p>\n<p><a href=\"https:\/\/forms.office.com\/Pages\/ResponsePage.aspx?id=UgtQB4udKEeKfjYa7B8HvQKUvRie1uhGiq81rRuGEXVUNlVBRFY4SjBSUks1OTQyRDBCTEc1NVpUWi4u\">https:\/\/forms.office.com\/Pages\/ResponsePage.aspx?id=UgtQB4udKEeKfjYa7B8HvQKUvRie1uhGiq81rRuGEXVUNlVBRFY4SjBSUks1OTQyRDBCTEc1NVpUWi4u<\/a><\/p>\n<p>If you wish to discuss access to onsite supervision please contact the College on 9807-2644 to speak to one of the Dean of Students Byron Chen for boys in Years 7-9 and Kim Beurs for students in Years 10-12.<\/p>\n<p><strong>Future Communications<\/strong><\/p>\n<p>We will be in regular contact via email to update you about any further developments.<\/p>\n<p>Best wishes,<\/p>\n<p><strong>Neil Carter<\/strong><br>\nActing Principal<\/p>\n<p><strong>COVID-19 Update – Friday 9 October 2020<\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>The Victorian Government has outlined the staged return to on-site schooling for all students, as part of its gradual roadmap towards reopening.<\/li>\n<li>From<strong> 5-9 October,<\/strong> remote learning will continue for all students, with VCE and VCAL students attending the College for essential assessments.<\/li>\n<li>From <strong>12-16 October,<\/strong> students in Year 7, 11 and 12 (and any other student undertaking VCE or VCAL) will attend on-site schooling.<\/li>\n<li>From <strong>26 October<\/strong>, students in Year 8 to Year 10 will return to on-site schooling. The existing remote learning program will not continue.<\/li>\n<li>We detail important <strong>Term Four calendar changes<\/strong> below.<\/li>\n<li>Further details on Term Four Year 12 arrangements (including SWOT VAC and exams) are communicated below.<\/li>\n<li>As on-site schooling resumes, the College will continue to uphold strong measures to protect the health and safety of students, staff, families and the community.<\/li>\n<li>All students must wear masks in accordance with the Chief Health Officers’ advice.<\/li>\n<li>Families are asked to ensure that their sons return to the College wearing their uniform proudly, being clean shaven and with appropriate hairstyles.<\/li>\n<li>The College’s three key priorities for Term Four are the mental health and wellbeing of our students and staff, supporting our students to learn and excel, and ensuring successful transitions for students at all year levels.<\/li>\n<\/ul>\n<p>Dear Parents and Carers,<\/p>\n<p>On behalf of our College, I want to say a big thank you to all our students, parents and carers for your continued resilience and support throughout this year. I know remote and flexible learning has not always been easy, but through our collective efforts, our students have continued to make valuable progress in their learning. You can be confident that we will support any student who has fallen behind to catch up.<\/p>\n<p>Term 4 is important for every student, and our teachers will strive to deliver high-quality learning for everyone. Whether we’re teaching remotely or face-to-face, our focus for Term 4 is on making sure that every student is supported in their wellbeing, learning and transition needs.<\/p>\n<p>Given the circumstances presented due to COVID-19, the College has made adjustments to ensure the College maximises face-to-face learning for our students. Changes are detailed below. We ask parents to carefully note these changes.<\/p>\n<p>The Victorian Government has outlined the staged return to on-site schooling for all students as part of its gradual roadmap towards reopening.<\/p>\n<p><strong>Term 4 on-site schooling arrangements for students<\/strong><\/p>\n<p>Following advice of the Victorian Chief Health Officer, the Victorian Government has released a staged approach for students to return to on-site schooling.<\/p>\n<p>The purpose of the plan is to get students back in the classroom as soon and as safely as possible, without putting at risk all that has been achieved through the period of restrictions to reduce the spread of coronavirus (COVID-19).<\/p>\n<p>For our school, the following arrangements apply:<\/p>\n<p><strong>Week 1 <\/strong><\/p>\n<p><strong>5<\/strong>–<strong>9 October <\/strong><\/p>\n<ul>\n<li>Remote and flexible learning will continue for all students<\/li>\n<li>VCE and VCAL students can only attend on-site for essential assessments, including the General Achievement Test (GAT) on Wednesday 7 October<\/li>\n<li>On-site supervision for children of permitted workers and vulnerable students will continue to be provided, consistent with existing guidelines.<\/li>\n<\/ul>\n<p><strong>Week 2 <\/strong><\/p>\n<p><strong>12-16 October<\/strong><\/p>\n<ul>\n<li>Students enrolled in Years <strong>7, 11 and 12 <\/strong>(and students in any other year level undertaking VCAL or VCE studies) will attend on-site schooling. The existing remote learning program will not continue for these year levels<\/li>\n<li><strong>PreCal <\/strong>students will return to onsite learning on their days with scheduled classes at the College.<\/li>\n<li>Remote and flexible learning will continue for all students in <strong>Year 8 to Year 10 <\/strong>(except students in any other year level studying VCE and VCAL units).<\/li>\n<li><strong>Year 10 students studying VCE and VCAL units MUST <\/strong>attend their scheduled classes at the College. Given travel issues and the need to attend remote learning classes, we strongly recommend that your son is on campus <strong>ALL DAY, <\/strong>for each day that they have scheduled classes. These students must sign in and out through Student Reception. If there is a reason for your son to leave the College, normal parental notification is required.<\/li>\n<li><strong>On-site supervision <\/strong>will remain available for students in <strong>Year 8 to Year 10 <\/strong>who are the children of permitted workers and vulnerable students. We ask that these boys attend the College in full summer uniform and sign in through student reception.<\/li>\n<\/ul>\n<p><strong>Week 4 <\/strong><\/p>\n<p><strong>From 26 October <\/strong><\/p>\n<ul>\n<li>Students in Year 8 to Year 10 will return to on-site schooling. The existing remote learning program will not continue.<\/li>\n<\/ul>\n<table style=\"height: 493px;\">\n<tbody>\n<tr style=\"height: 52px;\">\n<td style=\"height: 52px; width: 294.688px;\">\n<h4>Important Calendar Changes<\/h4>\n<\/td>\n<td style=\"height: 52px; width: 294.688px;\"><strong> <\/strong><\/td>\n<\/tr>\n<tr style=\"height: 53px;\">\n<td style=\"height: 53px; width: 294.688px;\"><strong>23 October <\/strong><\/td>\n<td style=\"height: 53px; width: 294.688px;\"><strong>No Classes – Public Holiday <\/strong><\/td>\n<\/tr>\n<tr style=\"height: 53px;\">\n<td style=\"height: 53px; width: 294.688px;\"><strong>26 October <\/strong><\/td>\n<td style=\"height: 53px; width: 294.688px;\">Valedictory Day<\/td>\n<\/tr>\n<tr style=\"height: 53px;\">\n<td style=\"height: 53px; width: 294.688px;\"><strong>29 and 30 October <\/strong><\/td>\n<td style=\"height: 53px; width: 294.688px;\">Yr 8 and 9 ACER tests<\/td>\n<\/tr>\n<tr style=\"height: 100px;\">\n<td style=\"height: 100px; width: 294.688px;\"><strong>4 November <\/strong><\/td>\n<td style=\"height: 100px; width: 294.688px;\"><strong>Staff Formation Day cancelled. All students to attend as timetabled.<\/strong><\/td>\n<\/tr>\n<tr style=\"height: 76px;\">\n<td style=\"height: 76px; width: 294.688px;\"><strong>4 – 11 November <\/strong><\/td>\n<td style=\"height: 76px; width: 294.688px;\">Yr 10 and 11 Exams (moved from 26 to 30 October)<\/td>\n<\/tr>\n<tr style=\"height: 53px;\">\n<td style=\"height: 53px; width: 294.688px;\"><strong>12 and 13 November <\/strong><\/td>\n<td style=\"height: 53px; width: 294.688px;\">Year 10 and 11 Mid Term Break<\/td>\n<\/tr>\n<tr style=\"height: 53px;\">\n<td style=\"height: 53px; width: 294.688px;\"><strong>16 November <\/strong><\/td>\n<td style=\"height: 53px; width: 294.688px;\">Headstart Program Commences<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Full details can be found on the online calendar that can be accessed via PAM.<\/p>\n<p><strong>Year 12 Arrangements<\/strong><\/p>\n<p><strong>Term 4 Week 2: <\/strong>Alternate timetable with two subject contacts for the week, and full physical trial exams. Note that during the practice exams in the Hall, normal Year 12 classes will continue for the boys who do not have an exam at that time.<\/p>\n<p><strong>Term 4 Week 3: <\/strong>Onsite classes will be held from Monday 19 to Thursday 22 October.<\/p>\n<p>Year 12s finish on Monday 26 October – this will be their last day. An event for the Class of 2020 is being planned, with full details to be distributed as soon as possible.<\/p>\n<p><strong>Week 4-5 SWOT VAC <\/strong>to reduce interruptions, maximise opportunities, reduce travel and limit conflicting schedules. The SWOT VAC will be conducted via MS Teams.<\/p>\n<p><strong>Written Exams Commence <\/strong>– English Exam to be held on Tuesday 10 November.<\/p>\n<p><strong>Health and Safety Measures<\/strong><\/p>\n<p>As on-site schooling resumes, we will continue to have in place strong measures to protect the health and safety of students, staff, families and the community. Parent\/Visitor access to school grounds is limited and we continue to place significant emphasis on hand hygiene and physical distancing where possible. Indoor spaces will have adequate ventilation with windows and doors open to outside wherever possible.<\/p>\n<p>The Government has advised that due to low community transmission, it is no longer necessary to temperature check students.<\/p>\n<p>If your son is unwell and displaying symptoms of Coronavirus, he must remain home and get tested. He must not return to school until a negative test result is received. All student absences must be notified to Student Reception. Please call the student absence line on 9831 9550.<\/p>\n<p><strong>Masks<\/strong><\/p>\n<p>All students must wear masks in accordance with the Chief Health Officers’ advice. Scarves, bandanas and face shields must not be worn as they do not comply with current regulations.<\/p>\n<p><strong>COVID Safe Plan<\/strong><\/p>\n<p>Salesian College is fully compliant with all protocols with regard to cleaning, maintaining best practice with hygiene and social distancing. The College COVID safe plan is regularly reviewed and updated accordingly. Parents are reminded not to congregate at school entry points.<\/p>\n<p><strong>Charter Bus<\/strong><\/p>\n<p>The Charter bus will resume normal operation from Monday 12 October.<\/p>\n<p><strong>Uniform Expectations<\/strong><\/p>\n<p>Families are asked to ensure that their sons return to the College wearing their uniform proudly, being clean shaven and with appropriate hairstyles.<\/p>\n<p>Families are reminded that boys are expected to wear their Summer Uniform.<\/p>\n<p>Please note that the shop is open for online ordering at <a href=\"https:\/\/www.academyuniforms.com.au\/login.php\">https:\/\/www.academyuniforms.com.au\/login.php<\/a><\/p>\n<p>Free delivery from Academy to Salesian College is available.<\/p>\n<p>As restrictions ease, a Click and Collect service will operate.<\/p>\n<p>Arrangements for additional opening times for the end of the year and January will be communicated as soon as they are available.<\/p>\n<p><strong>Sport and PE<\/strong><\/p>\n<p>Non-contact sport is permitted in compliance with COVID safe practices.<\/p>\n<p><strong>Canteen<\/strong><\/p>\n<p>The Canteen will be open as per normal and we ask that the boys are mindful of practicing social distancing at all times. Your son will need to bring his own drink bottle as the fountains are not accessible.<\/p>\n<p><strong>Support for your son<\/strong><\/p>\n<p>Whether your child is, or children are, returning to face-to-face learning or will be continuing with remote and flexible learning for a short period, please be assured we will be focused on three key priorities in Term 4:<\/p>\n<p><strong>Mental health and wellbeing <\/strong><\/p>\n<p>Our highest priority will be the wellbeing, particularly the mental health, of every student and member of staff. This means effectively mobilising all available resources to support our most vulnerable students and enabling staff to access the relevant support services.<\/p>\n<p><strong>Learning and excellence <\/strong><\/p>\n<p>Some of our students have thrived in the remote and flexible learning environment, others have maintained their learning progress, and some have fallen behind, despite their best efforts and those of their families and teachers. Our priority will be supporting both those who need it to catch up and those who have progressed to continue to extend their learning.<\/p>\n<p><strong>Transitions <\/strong><\/p>\n<p>We will make every effort to ensure successful transitions for students at all year levels.<\/p>\n<p>Working with you, our school has shown that it can be flexible and adaptable in responding to the challenges of coronavirus (COVID-19). We will continue to meet student needs as we look towards the end of the 2020 school year and ahead to 2021.<\/p>\n<p>Kind regards,<\/p>\n<p><strong>Rob Brennan<\/strong><br>\nPrincipal<\/p>\n<p><strong>COVID-19 Update – Friday 18 September 2020<\/strong><\/p>\n<p><strong>Summary: <\/strong><\/p>\n<ul>\n<li>The Victorian Government made significant announcements in their ‘Road Map Out’ Plan. Below, we details how these announcements impact Term Four at Salesian College.<\/li>\n<li>On Monday 5 October, remote learning will commence for all students.<\/li>\n<li>On Wednesday 7 October, students undertaking a Unit 3\/4 subject will attend the College to undertake their General Ability Test (GAT).<\/li>\n<li>On Monday 12 October, Years 11 and 12 students will return for face-to-face learning. This includes VCAL students and Year 10 students studying a Unit 2 subject.<\/li>\n<li>Years 7-10 students will continue with remote learning.<\/li>\n<li>The College has a COVID-19 plan and is complying with all government regulations.<\/li>\n<li>Boys who are returning to the College in Term Four are expected to wear their summer uniforms.<\/li>\n<li>We share a Coronavirus fact sheet, a Wellbeing resource video from Dr Michael Carr-Greg and Centrelink Student Resource Kit.<\/li>\n<\/ul>\n<p>Dear Parents and Carers,<\/p>\n<p>I hope you and your families have been able to remain positive during this prolonged lockdown period, and to make the most of the opportunities available to you. It’s hard to believe we still find ourselves back in a lockdown situation and needing to talk about alternative arrangements for delivering an education. Unfortunately, given this is our reality we once again need to work together in the best interests of our boys.<\/p>\n<p>The Victorian Government made some significant announcements last week in their ‘Road Map Out’ plan. This memo is a summary of those announcements and the impacts on us here at Salesian College.<\/p>\n<p><strong>Term 4 Arrangements<\/strong><\/p>\n<p>As per directions from the Victorian Government and Catholic Education Melbourne, the following arrangements will be in place:<\/p>\n<table>\n<tbody>\n<tr>\n<td width=\"170\"><strong>Monday, 5 October <\/strong><\/td>\n<td width=\"431\"><strong>Remote learning<\/strong> commences for all students. (Please note the return date as it differs from our normal practice).\n<p> <\/p><\/td>\n<\/tr>\n<tr>\n<td width=\"170\"><strong>Wednesday, 7 October<\/strong><\/td>\n<td width=\"431\">Students undertaking a <strong>Unit 3\/4 subject<\/strong> attend the College to undertake the <strong>General Ability Test (GAT).<\/strong> Arrangements have been communicated to these students and families.\n<p> <\/p><\/td>\n<\/tr>\n<tr>\n<td width=\"170\"><strong>Monday, 12 October<\/strong><\/td>\n<td width=\"431\"><strong>Year 11 and 12<\/strong> students return for face-to-face learning. (This <strong>includes VCAL<\/strong> students.)\n<p><strong>Year 10 students<\/strong> studying a <strong>Unit 2 subject<\/strong> return for face-to-face learning in those subjects, and remote learning in all other subjects.<\/p>\n<p><strong>Year 7-10 students<\/strong> continue remote learning.<\/p>\n<p> <\/p><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p> <\/p>\n<p>The College has a Covid19 plan that complies with all government regulations with regard to:<\/p>\n<ul>\n<li>Enhanced cleaning protocols<\/li>\n<li>Social distancing<\/li>\n<li>Mask wearing<\/li>\n<li>Temperature checking<\/li>\n<li>Recording of details of all people on site.<\/li>\n<\/ul>\n<p><strong>SUMMER UNIFORM<\/strong><\/p>\n<p>Families are reminded that boys are expected to wear their Summer Uniform upon return to school in Term 4.<\/p>\n<p>Please note that the Academy Uniform Shop is open for online ordering at <a href=\"https:\/\/www.academyuniforms.com.au\/login.php\">https:\/\/www.academyuniforms.com.au\/login.php<\/a><\/p>\n<p>Free delivery from Academy Uniforms to Salesian College is available, where you can pick up your order from Salesian. As restrictions ease, a Click and Collect service will operate. Arrangements for additional opening times for the end of the year and January will be communicated as soon as they are available.<\/p>\n<p>I know that the uncertainty and another period of dislocation for most of our families will be taking a toll. The school is doing everything it can to mitigate the impact of these changes on our community, and to minimise the impact of this disruption on your child’s learning journey. We are still awaiting exact details as to what the Term Four is to look like for students in Years Seven to Ten, and once we know this, we will inform the community. You can be reassured that all arrangements we have had previously will be available to support families needing for their son to come into school for boys in Years 7 – 10.<\/p>\n<p>If there are to be any further changes to the arrangements for the start of Term 4, we will update you as soon as we become aware. Once again, I thank you in anticipation for your patience and support.<\/p>\n<p><strong>Some additional resources are included below.<\/strong><\/p>\n<p><strong>Coronavirus Fact Sheet<\/strong><br>\nOne of the most important things we can do is to stay at home when we are unwell, even when we have the mildest cold or flu-like symptoms. Catholic Education have prepared a factsheet to assist the Community in understanding what to do if people display symptoms.<\/p>\n<p>The factsheet contains information on expectations:<\/p>\n<ul>\n<li>If a child is unwell, even with the mildest symptoms, they must stay home<\/li>\n<li>If a child has any of the listed symptoms of coronavirus (COVID-19), however mild, they should be tested<\/li>\n<li>A child must stay at home until they are symptom-free, even if their COVID-19 test is negative<\/li>\n<li>Children do not need a medical certificate before returning to school.<\/li>\n<\/ul>\n<p>The factsheet can be accessed <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/09\/Managing-student-illness-in-schools-during-COVID-19.pdf\">here.<\/a><\/p>\n<p><strong>Wellbeing Resources<\/strong><br>\nSchoolTV has generously shared a special report video with the CECV as part of its Coronavirus series.<\/p>\n<p>In this presentation, <a href=\"http:\/\/coms.cem.edu.au\/EmRedirect.aspx?nid=ea92fe9d-d49d-4c1d-851b-bc22e4a66a13&amp;sid=7c08ddd3-c6a0-4807-bcd5-9ff9b2eabb8a&amp;url=https%3a%2f%2fschooltv.me%2fwellbeing_news%2fspecial-report-riding-corona-coaster\">Riding the Corona Coaster<\/a>, Dr Michael Carr-Gregg explores how the uncertainty of not knowing what will happen next may impact students, families and staff in school communities. He examines increasing concerns regarding mental health issues such as anxiety, depression and substance abuse among young people, and emphasises the importance of promoting help-seeking behaviour and reducing stress levels at home. Dr Carr-Gregg provides tips for parents\/carers on looking after their wellbeing during this challenging time.<\/p>\n<p><strong>Centrelink Student Resource Kit<\/strong><br>\nCentrelink has developed a new <a href=\"http:\/\/coms.cem.edu.au\/EmRedirect.aspx?nid=ea92fe9d-d49d-4c1d-851b-bc22e4a66a13&amp;sid=7c08ddd3-c6a0-4807-bcd5-9ff9b2eabb8a&amp;url=https%3a%2f%2fwww.servicesaustralia.gov.au%2forganisations%2fbusiness%2fyour-business-sector%2feducation-and-training-providers%2fresources-education-and-training-providers%2fresources-school-leavers\">Student Resource Kit<\/a> to inform students about payments they can get after high school.<\/p>\n<p>The kit includes factsheets, guides to online services, tips on claiming, tools to work out how much students could get each fortnight, translated material and videos.<\/p>\n<p>To finish I wish to congratulate the vast majority of boys on the way they have persevered during these tough times and stayed on top of their work. They are a credit to themselves, their families and the College and should be rightfully proud of themselves. I hope they are now able to enjoy a well-earned break and prepare themselves for a positive end to what has been a tough year.<\/p>\n<p><strong>Mr Rob Brennan<\/strong><br>\nPrincipal<\/p>\n<p> <\/p>\n<p><strong>COVID-19 Update – Monday 3 August 2020<\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>On Sunday 2 August, the Victorian Government announced that metropolitan Melbourne will move to Stage 4 restrictions to slow the spread of coronavirus (COVID-19)<\/li>\n<li><strong>Tuesday 4 August<\/strong> will be a student-free day. No on-site supervision is available on this day.<\/li>\n<li><strong>From Wednesday 5 August,<\/strong> all Years 11 and 12 VCE and VCAL students will move to remote learning. Years 7 to 10 students will continue with remote learning.<\/li>\n<li>Learning Conferences will continue as planned on Wednesday 5 August. No on-site supervision is available on this day.<\/li>\n<li>Further details of our remote learning provisions are detailed below.<\/li>\n<li>The criteria for students that can access on-site supervision has changed (further details below).<\/li>\n<li>The College requests that families who require on-site supervision for their sons contact Student Reception.<\/li>\n<li>Year 12 students will receive an email today that outlines changes to exam preparation, including masterclass arrangements, SACS and information relating to the change of date of the General Ability Test (GAT).<\/li>\n<li>We share <a href=\"https:\/\/www.youtube.com\/watch?v=YdQgeMeSMys&amp;feature=youtu.be\">a video resource<\/a> that provides instructions on Accessing Remote Lesson Plans via PAM.<\/li>\n<li>We provide<a href=\"https:\/\/www.salesian.vic.edu.au\/2020\/07\/simon-everywhere-2\/\"> further guidance<\/a> on booking and attending Learning Conferences.<\/li>\n<\/ul>\n<p>Dear Parents,<\/p>\n<p>I hope that you and your families have been able to stay safe and happy in spite of the circumstances in which we find ourselves. I encourage you to continue to isolate, keep safe and remain healthy, while spending quality time together as a family and making the most of these trying times. We must now look to the coming weeks and prepare ourselves for what is going to be a very different and challenging time. It is a very difficult time for all concerned. Nothing would make all of us happier than to be returning to some form of normality, but unfortunately this can’t happen and we must make the most of what we have.<\/p>\n<p>Yesterday the Victorian Government announced that on the advice of the Victorian Chief Health Officer, metropolitan Melbourne will move to Stage 4 restrictions to slow the spread of coronavirus (COVID-19). These requirements apply to all schools in metropolitan Melbourne.<\/p>\n<p>The changes to schools’ operations will come into effect from <strong>Wednesday 5 August<\/strong> <strong>2020<\/strong>, following a <strong>student free day on Tuesday 4 August<\/strong>, and are likely to apply until the end of Term 3.<\/p>\n<p>As outlined in the Chief Health Officer’s advice on Friday, schools remain safe places for staff and students – but these steps are critical measures to reduce the movement of students and families across the state.<\/p>\n<p>There are implications for our school, and for families in our school community.<\/p>\n<p>A summary of what the changes mean for Salesian College is below.<\/p>\n<p><strong>YEAR 7 TO YEAR 10<\/strong><\/p>\n<ul>\n<li>Year 7 to Year 10 students will continue with remote and flexible learning.<\/li>\n<\/ul>\n<p><strong>SENIOR SECONDARY YEAR 11 AND 12 (VCE AND VCAL)<\/strong><\/p>\n<ul>\n<li>All Year 11 and 12 provisions for both VCE and VCAL will move to remote and flexible learning.<\/li>\n<\/ul>\n<p>The <strong>outline of our program<\/strong> is as follows:<\/p>\n<ul>\n<li><strong>Tuesday 4 August is a student free day<\/strong> to enable staff to make appropriate adjustments to teaching and learning (as directed by the State Government). This will mean that no on-site supervision can be provided on this day.<\/li>\n<li><strong>Remote Classes<\/strong> for all year levels will start from period one on Wednesday 5 August.<\/li>\n<li><strong>Learning Conferences<\/strong> will continue as planned on Wednesday 5 August. (No on-site student supervision can be provided on this day).<\/li>\n<li>Teachers will continue to facilitate at least <strong>two virtual Microsoft Teams meetings<\/strong> each week. Attendance will be taken each lesson, utilising either student attendance during these meetings and\/or by students engaging with the lesson’s learning materials on SIMON.<\/li>\n<li>Teachers will connect live with students as required. The first meeting of the week will involve setting the program for the week ahead and directing students to the teaching and learning materials.<\/li>\n<li><strong>All lesson plans<\/strong> will be posted on SIMON which students <strong>must<\/strong> This will act as a monitor of attendance.<\/li>\n<li>Students will then work their way through the material over the week, checking in with their teachers as required for further directions or clarification.<\/li>\n<li>Teachers will again check in live with their students late in the week to see how they have gone with the teaching and learning activities.<\/li>\n<li>Teachers will make themselves available to their students in scheduled class time to answer emails and provide any clarifications required.<\/li>\n<\/ul>\n<p><strong>SUPERVISION OF STUDENTS AT SALESIAN COLLEGE<\/strong><\/p>\n<ul>\n<li>The criteria for students that can attend on-site has changed, and is now as follows:\n<ul>\n<li>Children whose parents are permitted workers.<\/li>\n<li>Vulnerable children in out of home care, children known to child protection and other agencies and children the school identifies as vulnerable.<\/li>\n<li>Children with a disability who also fit one of the above two categories.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>The Victorian Government will provide further advice about this over the coming days.<\/p>\n<p>Supervision here at school will be undertaken by Library Staff and Learning Support Officers. Students coming into school will access the remote learning being offered by their teachers, whilst under the supervision of our support staff. There will be no normal services provided for the boys, such as the Canteen, charter buses or the like, and the boys are not expected to wear their uniforms.<\/p>\n<p>I think it is appropriate to again remind all in our community that staying home and staying safe is the best option, as the sooner we stop the spread of this virus the sooner we can get back to normality.<\/p>\n<p>We are asking any family likely to send their son to school for supervision to inform us by communicating to <a href=\"mailto:studentreception@salesian.vic.edu.au\">studentreception@salesian.vic.edu.au<\/a> or by phoning the Absentee line on 9831 9550 so that we can make appropriate supervision arrangements.<\/p>\n<p><strong>YEAR 12<\/strong><\/p>\n<p>Parents of our Year 12 boys are likely to be quite anxious, which I totally understand, as they try to deal with what is a very stressful year under normal circumstances, let alone what they are being asked to deal with currently. Your son will receive an email today that outlines changes to exam preparation including Masterclass arrangements, SACS and information relating to the <strong>change of date of the General Ability Test (GAT).<\/strong> This examination has been postponed from September 9 to <strong>October 7<\/strong>. The schedule for the VCE examinations and release of results will remain as previously advised. Further information about consideration of disadvantage and coronavirus (COVID-19) will be provided shortly.<\/p>\n<p>In the meantime, I encourage you to comfort your sons and remind them that they are not alone in this, that every senior student across Victoria is going through the same thing, and that it will be the kids who are able to adjust and adapt quickly that will have the greatest success. Remind them that in life we should worry about the things we can control and leave the other things for others to worry about.<\/p>\n<p><strong>CONTINUITY OF LEARNING INFORMATION<\/strong><\/p>\n<p>We would like to take this opportunity to thank parents and guardians for their support during this year. We thank you and value your feedback. As we embark on the next phase, we have made several adjustments to ensure an effective and meaningful learning experience for all students.<\/p>\n<p>Please review the video link below which offers instructions for both students and parents\/guardians on Accessing Remote Lesson Plans via PAM. It should be noted that parents and guardians now have the ability to check each lesson via PAM.<\/p>\n<p><a href=\"https:\/\/youtu.be\/YdQgeMeSMys\">https:\/\/youtu.be\/YdQgeMeSMys<\/a><\/p>\n<p>Here is <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/07\/Salesian_ContinuityLearning_Graphic_V7.pdf\">an updated suite of infographics<\/a> to support and inform parents and guardians.<\/p>\n<p>The College prides itself on being responsive to student needs. Should you wish to offer further general feedback regarding your son’s remote learning experience, please feel free to directly contact the College using the following email: <a href=\"mailto:learningfeedback@salesian.vic.edu.au\">learningfeedback@salesian.vic.edu.au<\/a>. A reminder that subject-specific queries should be raised with the individual subject teacher. Should your feedback be related to an individual teacher’s practice, please feel free to direct your enquiry to the Principal.<\/p>\n<p><strong>LEARNING CONFERENCES<\/strong><\/p>\n<p>Information regarding booking times for Wednesday 5 August and attending the meetings via Microsoft Teams <a href=\"https:\/\/www.salesian.vic.edu.au\/2020\/07\/simon-everywhere-2\/\">can be found here.<\/a><\/p>\n<p>I thank you for your patience and for your support.<\/p>\n<p><strong>Robert Brennan<\/strong><br>\nPrincipal<\/p>\n<p><strong>COVID-19 Update – Friday 24 July 2020<\/strong><\/p>\n<p><strong>Summary<\/strong><\/p>\n<ul>\n<li>The College continues to follow all recommended procedures in line with Government guidelines.<\/li>\n<li>Below we detail current Commonwealth Government guidelines on testing and quarantine procedures.<\/li>\n<\/ul>\n<p>The College continues to follow all procedures in line with the Victorian Government’s measures to reduce the spread of COVID-19 in schools across Metropolitan Melbourne and Mitchell Shire. We wish to take this opportunity to provide our community with the below Commonwealth Government guidelines on testing and quarantine.<\/p>\n<p><strong>Should I self-isolate if I’ve had contact with a suspected case of COVID-19 or someone who’s being tested for COVID-19?<\/strong><\/p>\n<p>Household contacts of suspected cases undergoing testing do not need to be in self isolation. The person who has symptoms and is undergoing testing should self-isolate while waiting for their results.<\/p>\n<p><strong>What should I do if I have been in close contact with a person with confirmed or probable COVID-19 infection?<\/strong><\/p>\n<p>If you’ve been in close contact with someone who’s a confirmed or probable case of COVID-19 — including close contact in the 48 hours before they became unwell — you must quarantine in your home for 14 days after your last contact with the confirmed or probable case. Someone from your local public health unit will contact you. If you remain well after 14 days you can leave quarantine.<\/p>\n<p>If you develop symptoms during this time, you must get tested for COVID-19. If you test positive, you must isolate. Anyone who’s entered your household is a close contact and must quarantine.<\/p>\n<p>If you test negative for COVID19, you must complete quarantine and stay at home for the full 14-day quarantine period.<\/p>\n<p><strong>Living with other people while in quarantine:<\/strong><\/p>\n<p>If you’re well, people you live with don’t need to quarantine unless they have had contact with a confirmed or probable case of COVID-19. You should limit your contact with them as much as possible by:<\/p>\n<p>• staying in your own room<\/p>\n<p>• using a separate bathroom, if you can<\/p>\n<p>• staying at least 1.5 metres away from each other<\/p>\n<p>• avoiding common areas and wearing a mask when moving through these areas<\/p>\n<p>• wearing a mask when in the same room as each other<\/p>\n<p>• not sharing a room with people, especially those at risk of severe disease. This includes older people and those with heart, lung or kidney conditions, and diabetes<\/p>\n<p>• practising good hand hygiene and covering coughs and sneezes with a clean tissue that you dispose of immediately or the inside of your elbow, then washing your hands<\/p>\n<p>• avoiding sharing household items<\/p>\n<p>• frequently cleaning the house, especially things people touch often, like door handles<\/p>\n<p>For more information, visit <a href=\"https:\/\/www.healthdirect.gov.au\/national-covid-19-helpline-faqs?tab=consumers&amp;nav=aHR0cDovL3RoZXNhdXJ1cy5oZWFsdGhkaXJlY3Qub3JnLmF1L2FodC8yNjY1MkNvbnN1bWVycw==\">health.gov.au<\/a><\/p>\n<p>Stay safe and stay healthy!<\/p>\n<p><strong>Robert Brennan<\/strong><br>\nPrincipal<\/p>\n<p><strong>COVID-19 Update – Tuesday 21 July 2020 <\/strong><\/p>\n<p><strong>Summary <\/strong><\/p>\n<ul>\n<li>We ask families to refer to our Term Three Teaching and Learning Update, communicated on Friday 17 July.<\/li>\n<li>The College has provided information on the upcoming Learning Conferences.<\/li>\n<li>All students attending the College for on-site classes or supervision will be required to wear masks from <strong>Thursday 23 July 2020.<\/strong><\/li>\n<li>The College is currently awaiting advice from the Government and Catholic Education Melbourne regarding the supply of masks.<\/li>\n<li>We recommend families provide students attending the College for on-site classes or supervision with masks as soon as possible.<\/li>\n<li>We remind families that all students attending the College must present themselves for temperature checks.<\/li>\n<li>We request that unwell students remain at home and seek medical advice. If your son needs to undergo COVID-19 testing, a copy of his test must be communicated to the College.<\/li>\n<\/ul>\n<p>Thank you for your assistance, patience and care for your boys during this time of uncertainty and unprecedented rapid change.<\/p>\n<p>On Friday, you received our Term 3 Teaching and Learning Update, highlighting some improvements to our delivery system.<\/p>\n<p>Please take the time to work through the content of the email with your son, view the <a href=\"https:\/\/youtu.be\/6eBtXiNUaU4\">instructional videos<\/a> and note the <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/07\/Salesian_ContinuityLearning_Graphic_V7.pdf\">updated infographics.<\/a><\/p>\n<p>Information on the upcoming Learning Conferences has also been provided.<\/p>\n<p>Change is the one constant at this time. Below is the latest advice in relation to the wearing of masks.<\/p>\n<p><strong>Masks<\/strong><\/p>\n<p>As you are aware, the Victorian Government has mandated the wearing of masks by all members of the community (over the age of 12) when leaving their homes, <strong>effective from Thursday 23 July 2020.<\/strong><\/p>\n<p>For students in Years 11 &amp; 12, those in Year 10 undertaking Unit 2 studies at the College and students attending the College for supervision, the rule will apply and will be enforced.<\/p>\n<p><strong>Our recommendation is that students commence wearing masks as soon as possible.<\/strong> The College is currently awaiting advice from the Government and the Catholic Education Office regarding the supply of masks.<\/p>\n<p>I strongly recommend that families make the necessary arrangements and provide students with adequate protection as soon as possible.<\/p>\n<p><a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/07\/Design-and-preparation-of-cloth-mask_0.pdf\"><strong>Click here to access DHHS Patterns<\/strong> for making masks.<\/a><\/p>\n<p><strong>Cloth Mask Hygiene<\/strong><\/p>\n<ol>\n<li>Wash or sanitise hands before putting mask on and taking it off.<\/li>\n<li>Avoid touching your eyes, nose, or mouth at all times, and store used face masks in a plastic bag until you have an opportunity to wash them.<\/li>\n<li>Cloth masks can be washed in the washing machine with other clothes, or hand-washed using soap and the warmest appropriate water setting for the cloth.<\/li>\n<\/ol>\n<p><strong>Single Use Mask Hygiene<\/strong><\/p>\n<ol>\n<li>Wash or sanitise hands before putting mask on and taking it off.<\/li>\n<li>Remove the mask by grabbing the ear loops.<\/li>\n<li>Place directly in a bin.<\/li>\n<\/ol>\n<p><strong>Some Reminders:<\/strong><\/p>\n<p><strong>Temperature Checks<\/strong><\/p>\n<p>I ask that you remind your sons that all boys entering the College between 8:15am and 8:45am are required to present to the Hall or to the Food Technology Rooms for their temperature checks. Boys arriving outside of these times should present to Student Reception before going to class or supervision areas.<\/p>\n<p><strong>Health Concerns<\/strong><\/p>\n<p>Boys are expected to stay at home if they are unwell and seek medical advice. If your son needs to present for COVID-19 testing, please inform Student Reception on 9831 9550 or send an email to <a href=\"mailto:studentreception@salesian.vic.edu.au\">studentreception@salesian.vic.edu.au<\/a>. <strong>A copy of his test must be communicated to the College.<\/strong> If siblings are NOT displaying symptoms they can come to school as per normal.<\/p>\n<p>If your son becomes unwell while at school, he will be isolated and you will be contacted immediately and requested to come to the College to pick him up as soon as possible.<\/p>\n<p>To our Year 7-10 boys and their families commencing Remote Learning V2, and to our students attending the College, I wish you all the best.<\/p>\n<p>Please contact the College if you require assistance with any aspects of your son’s schooling.<\/p>\n<p>Take care and stay safe,<\/p>\n<p><strong>Robert Brennan<\/strong><br>\nPrincipal<\/p>\n<p><strong>COVID-19 Update – Tuesday 14 July 2020 <\/strong><\/p>\n<p><strong>Summary<\/strong><\/p>\n<ul>\n<li>From <strong>Tuesday 14 July to Friday 17 July<\/strong>, Years 11 and 12 students will be required to attend the College for face-to-face learning.<\/li>\n<li>Year 10 students undertaking a VCE or VCAL subject will be also required to attend the College during this time for their Unit 2 classes only.<\/li>\n<li>All boys arriving at the College will have their temperature checked.<\/li>\n<li>Years 7-10 are asked to remain at home on an extended school holiday break from Tuesday 14 July to Friday 17 July.<\/li>\n<li>Students in these year levels are asked to collect their learning materials during this time from College Reception.<\/li>\n<li><strong>Remote learning will resume for Years 7-10 students from Monday 20 July.<\/strong><\/li>\n<li>Years 11 and 12 and Year 10 boys undertaking a VCE or VCAL subject will continue with face-to-face learning from Monday 20 July.<\/li>\n<li>Students whose families require their sons to be supported at the College may make arrangements for their sons to undertake their remote learning at the College.<\/li>\n<\/ul>\n<p>We understand that there is a great deal of uncertainty and anxiety in the community at this time as we enter another phase of remote learning. However, I can guarantee that the staff at the College are all working diligently to provide the best possible learning, teaching and pastoral care possible. We have learnt a great deal from our previous experience of remote learning, and I can assure you staff are working diligently to deliver Remote Learning Phase 2 in the most effective and meaningful way for our boys.<\/p>\n<p>Based on advice from the Victorian Chief Health Officer, Catholic schools in metropolitan Melbourne and Mitchell Shire will have specific arrangements in place for the start of Term 3. It is very important to note that the Victorian Chief Health Officer has advised that schools can continue to operate. Salesian College will take direction from the appropriate government areas and from Catholic Education Melbourne. We will ensure that we do everything in our power to keep our community safe.<\/p>\n<p>The purpose of these changed arrangements is to reduce the number of students and families moving across metropolitan Melbourne and Mitchell Shire in order to reduce the spread of coronavirus (COVID-19).<\/p>\n<p>It is, however, important that face-to-face teaching be maintained for some students. This includes students in Years 11 and 12 (and Year 10 students who have VCE studies or VCAL strands in their learning program) because of the importance of enabling all students to continue or complete their senior secondary certificate, either VCE or VCAL.<\/p>\n<p>Staff will be working to prepare for the next phase of flexible and remote learning.<\/p>\n<p><strong>What this means for your son, and what we are asking you to do:<\/strong><\/p>\n<p><strong>Tuesday 14 July – Friday 17 July<\/strong><\/p>\n<p><strong>Years 11 and 12<\/strong> <strong>and<\/strong> <strong>Year 10 boys undertaking VCE or VCAL studies<\/strong><\/p>\n<ul>\n<li>Return for face-to-face learning.<\/li>\n<li><strong>Year 10 boys<\/strong> are required to attend for their Unit 2 classes only. Please note that remote learning is NOT available for these classes. Please follow our student absence process if your son is not attending classes. Boys are required to sign in and out through Student Reception.<\/li>\n<\/ul>\n<p><strong>Year 7 -10<\/strong><\/p>\n<ul>\n<li>Remain at home on an extended school holiday period (with the exceptions as noted below in the student supervision note).<\/li>\n<li>Come to College Reception (from 8:30 am to 4:15pm) to collect learning materials from lockers.<\/li>\n<\/ul>\n<p><strong>Year 7A, 7B, 7C and 7F students<\/strong><\/p>\n<ul>\n<li>Please come to College Reception to arrange to collect your musical instrument for your Semester 2 classes.<\/li>\n<\/ul>\n<p><strong>Student Supervision<\/strong><\/p>\n<ul>\n<li>Students whose families require their son to be supported at the College where parents or carers cannot work from home may attend the College for supervision. Please note that as formal classes will not be running during this week, the program will not provide any teaching and learning.<\/li>\n<li>Please notify Student Reception (<a href=\"mailto:studentreception@salesian.vic.edu.au\">studentreception@salesian.vic.edu.au<\/a> or by phoning the College Absentee line 9831 9550) if your son requires an onsite supervision program during this week.<\/li>\n<\/ul>\n<p><strong>From Monday 20 July<\/strong><\/p>\n<p><strong>Years 11 and 12<\/strong> <strong>and<\/strong> <strong>Year 10 boys undertaking VCE or VCAL studies<\/strong><\/p>\n<ul>\n<li>Continue face-to-face learning.<\/li>\n<li><strong>Year 10 boys<\/strong> are required to attend only their Unit 2 class. Please note that remote learning is NOT available for these classes. Remote learning will be provided for all other subjects. Your son may choose to remain at the College for his remote learning or return home. If he does not remain at the College, he must ensure that he does not miss any content from his other subjects. Year 10 boys need to check in and out through Student Reception and while at school will either be in class or in the Remote Learning supervision areas.<\/li>\n<\/ul>\n<p><strong>Year 7 -10<\/strong><\/p>\n<ul>\n<li>Resume remote learning.<\/li>\n<\/ul>\n<p><strong>Student Supervision<\/strong><\/p>\n<ul>\n<li>Students whose families require their son to be supported at the College may make arrangements for their sons to undertake their remote learning at the College. These include sons of workers who are unable to work from home, students who require additional learning support and students who may be vulnerable working from home.<\/li>\n<li>To allow for appropriate supervision, parents are asked to notify their intent to send their sons to the College and the days they will be in attendance at the College to Student Reception via email to (<a href=\"mailto:studentreception@salesian.vic.edu.au\">studentreception@salesian.vic.edu.au<\/a> or by phoning the College Absentee line 9831 9550.)<\/li>\n<\/ul>\n<p><strong>Student Absences <\/strong><\/p>\n<p>All student absences must be notified to Student Reception by phoning the College Absentee line 9831 9550 or by email to <a href=\"mailto:studentreception@salesian.vic.edu.au\">studentreception@salesian.vic.edu.au<\/a><\/p>\n<p>If you are entering an absence through PAM please add specific detail (e.g. Flu like symptoms).<\/p>\n<p>Please notify Student Reception is your son is being tested for COVID-19. Once the test result is obtained, please provide a copy of the results to the above email address.<\/p>\n<p><strong>Student Temperature Checks<\/strong><\/p>\n<p>All boys arriving at the College will have their temperature checked. If they present with a temperature of 37.5 or above the College will contact you and ask you to collect your son as quickly as possible and seek medical advice.<\/p>\n<p><strong>Masks<\/strong><\/p>\n<p>Victoria’s Chief Health Officer has confirmed that the use of face masks or coverings by adults or children is not recommended in schools at this time. As has always been the case, students who wish to wear face masks in school and when going to and from school may do so.<\/p>\n<p><strong>Charter Bus<\/strong> will operate as per normal and the <strong>Canteen<\/strong> is open as per normal.<\/p>\n<p>And, finally, a reminder that if you, your child or a family member develop symptoms of a fever, chills or sweats, cough, sore throat, shortness of breath, runny nose, or loss of smell or taste, you should get tested at a coronavirus (COVID-19) testing facility and stay home.<\/p>\n<p>If you would like health information from the Department of Health and Human services, you can visit <a href=\"https:\/\/www.dhhs.vic.gov.au\/coronavirus\">www.dhhs.vic.gov.au\/coronavirus<\/a>.<\/p>\n<p>I will continue to communicate with you as soon as we receive further information.<\/p>\n<p>I thank everyone in this wonderful Salesian Community for your understanding and patience. We will get through this together. Please contact the College if you have any questions or concerns.<\/p>\n<p>Yours sincerely,<\/p>\n<p><strong>Robert Brennan<br>\n<\/strong>Principal<\/p>\n<p><strong>COVID-19 Update – Thursday 9 July 2020<\/strong><\/p>\n<p><strong>Summary<\/strong><\/p>\n<ul>\n<li>The Victorian Government is introducing new measures for schools across Metropolitan Melbourne and Mitchell Shire to reduce the spread of COVID-19. These new measures apply to Salesian College.<\/li>\n<li>Onsite classes will resume for students enrolled in Years 11 and 12, and Year 10 students enrolled in a VCE subject on Tuesday 14 July 2020.<\/li>\n<li>Year 10 students enrolled in VCE subjects are only required to attend the College for their Unit 2 classes.<\/li>\n<li>Students in Years 7 to 10 will have their holiday break extended by one week.<\/li>\n<li>Classes are expected to resume for Years 7-10 on Monday 20 July 2020<\/li>\n<li>The College will communicate further information with families as soon as this is available to us.<\/li>\n<\/ul>\n<p>I hope you and your family have been able to make the most of the opportunities the school holidays provide. It’s hard to believe we find ourselves back in a lock down situation, needing to talk about alternative arrangements for delivering an education. Unfortunately, given this is our reality, we once again need to work together in the best interests of our boys.<\/p>\n<p>The Victorian Government has made some significant announcements about the introduction of new measures for schools across metropolitan Melbourne and Mitchell Shire to reduce the spread of coronavirus (COVID-19).<\/p>\n<p>These include a change to arrangements for schools at the start of <strong>Term 3.<\/strong><\/p>\n<p>As our school is in an affected area, the government’s new measures will apply to us.<\/p>\n<p><strong>Students in Years 11 and 12 and Year 10 students enrolled in VCE study<br>\n<\/strong>Onsite classes will resume for students enrolled in Years 11 and 12, and students in Year 10 enrolled in a VCE study on Tuesday 14 July 2020.<\/p>\n<p><strong>Year 10 students enrolled in VCE<\/strong> <strong>subjects <\/strong>are required to attend the College next week for their Unit 2 classes only. Further details will be communicated early next week.<\/p>\n<p><strong>Students in all other year levels<br>\n<\/strong>Students in Years 7 to 10 (not enrolled in VCE subjects) will have their holiday break extended by a week. There will be five student-free days from Monday 13 to Friday 17 July 2020. Classes are expected to resume for these students on Monday 20 July 2020.<\/p>\n<p><strong>Please Note: <\/strong><\/p>\n<ul>\n<li>The <strong>Charter Bus<\/strong> service will resume on Tuesday 14 July<\/li>\n<li>The<strong> Canteen<\/strong> will be available<\/li>\n<li>If your son is <strong>unwell<\/strong>, please keep him at home and seek medical advice<\/li>\n<\/ul>\n<p>I know that this may mean uncertainty and another period of dislocation for you and your family. The College is doing everything it can to mitigate the impact of these changes on our community, and to minimise the impact of this disruption on your child’s learning journey.<\/p>\n<p>We are still awaiting exact details as to what the term will look like. Once we know, we will inform our community. You can be reassured that all arrangements we have had previously will be available to support families with sons in Years 7 – 10 who need to come to school. Please contact the College office to notify us of these needs.<\/p>\n<p>If there are any further changes to our start of Term 3 arrangements, we will update you as soon as we become aware. Once again, I thank you in anticipation of your patience and support.<\/p>\n<p><strong>Rob Brennan<\/strong><br>\nPrincipal<\/p>\n<p> <\/p>\n<p><strong>COVID-19 Update – Friday 5 June 2020<\/strong><\/p>\n<p><strong>Summary<\/strong><\/p>\n<ul>\n<li>The College is excited to welcome back Years 7 to 10 students on Tuesday 9 June<\/li>\n<li>Our priority is to keep students and staff safe in the current environment<\/li>\n<li>We remind families that remote learning will cease today, Friday 5 June<\/li>\n<li>We encourage families to seek alternative drop off and pick up locations, as we anticipate there to be higher traffic congestion on College grounds<\/li>\n<li>Students are required to wear their full winter uniforms on returning to school<\/li>\n<li>Students’ appearance must be in line with the College’s expectations in relation to uniform, hairstyle and facial hair<\/li>\n<li>All students are expected to maintain the highest standards of personal hygiene and to stay home if they are unwell<\/li>\n<li>We thank all in our College community for working together to support our students during this time<\/li>\n<\/ul>\n<p>The College is excited to welcome back students from Years 7 to 10 on Tuesday 9 June. The return of our senior students injected positive life back into our classrooms and yard, that had stood silent for a significant number of weeks.<\/p>\n<p>The College’s priority remains one of keeping students and staff safe in the current environment.<\/p>\n<p><strong>A few reminders:<\/strong><\/p>\n<ul>\n<li>Remote Learning for all students will cease today.<\/li>\n<li>Please seek alternative drop off and pick up locations as it is anticipated there will be significant congestion around the College grounds, as more families drive their sons to and from school.<\/li>\n<li>Parents are asked to remain in their cars.<\/li>\n<li>The Charter bus service is running as per normal arrangements.<\/li>\n<li>Boys are required to wear their full winter uniforms. Sports Uniform may be worn on designated Sports Days and brought to school on PE days.<\/li>\n<li>Students’ appearance must be in line with the College’s expectations in relation to uniform, hairstyle and facial hair.<\/li>\n<li>Boys will be expected to maintain the highest standards of personal hygiene including:\n<ul>\n<li>Using hand sanitiser on entering all classes<\/li>\n<li>Wiping down their tables and chairs at the commencement of each class with an antibacterial wipe<\/li>\n<li>Ensuring they adhere to a strict hands off policy<\/li>\n<li>Supplying their own water bottles as drinking taps have been disabled<\/li>\n<li>Using a personal hand sanitiser is advisable<\/li>\n<\/ul>\n<\/li>\n<li>Boys are expected to stay at home if they are unwell and seek medical advice.<\/li>\n<li>If your son becomes unwell whist at school he will be isolated and you will be contacted immediately and requested to come to the College to pick him up as soon as possible.<\/li>\n<li>Please ensure your son’s medical details have been verified in PAM.<\/li>\n<li>The status of our Camps, Excursions and Events will be communicated to you as soon as updates are received, and will be subject to both Government and Catholic Education restrictions.<\/li>\n<\/ul>\n<p>I wish to take this opportunity to thank the Salesian College Community for its response to this very difficult time in our history.<\/p>\n<p><strong>My heartfelt thanks to:<\/strong><\/p>\n<ul>\n<li>The Leadership Team for their constant commitment to providing the best outcomes for the students.<\/li>\n<li>The teaching staff for their ability to adapt in a very short time to deliver the Remote Learning Program in such an effective and efficient way.<\/li>\n<li>The support staff for the back-up they provide in a multitude of ways to enable our boys to learn and to be supported.<\/li>\n<li>The families of our boys for their support of their sons and of the College.<\/li>\n<li>The student leaders for endeavouring to maintain Salesian pride and a sense of connection.<\/li>\n<li>Lastly to the amazing students of Salesian College who have embraced the new way of learning, and to the majority of boys who have continued to show the characteristics of Salesian boys.<\/li>\n<\/ul>\n<p><em>“We’re side by side with joyful pride, Salesians true.”<\/em><\/p>\n<p><strong>Robert Brennan<\/strong><br>\nPrincipal<\/p>\n<p> <\/p>\n<p><strong>Summary: <\/strong><\/p>\n<ul>\n<li>We thank parents for supporting the College during the last few weeks of remote learning and encourage our community to take pride in what we have achieved together, as we look towards our return to school.<\/li>\n<li>Monday 25 May will be a student-free day.<\/li>\n<li><strong>First Stage:<\/strong> Years 11 and 12 VCE and VCAL students will return to school from <strong>Tuesday 26 May.<\/strong><\/li>\n<li>Year 10 students undertaking VCE studies (including VET studies) are also able to attend school for those classes from Tuesday 26 May. Further details on arrangements for Year 10 students are detailed below.<\/li>\n<li><strong>Second Stage:<\/strong> All other year levels to return to the College from <strong>Tuesday 9 June.<\/strong><\/li>\n<li>From Tuesday 26 May to Tuesday 9 June, onsite supervision will continue to be available to students who cannot be supervised at home (further details below).<\/li>\n<li>Once a year level has returned, all students will be expected to attend school as normal. If you choose to keep your child\/children home after their year level has returned to onsite schooling, they will not be supported in learning from home. This does not apply to children who need to be absent for health or medical reasons.<\/li>\n<li>From 26 May all students attending the College for classes or supervision must wear their full school uniform. We encourage you to visit Academy Uniforms as soon as possible if you require.<\/li>\n<li><strong>Risk Minimisation:<\/strong> Whilst the Chief Health Officer’s advice is that students will not be required to maintain physical distancing at school there will be a number of other important changes to our school operations, consistent with health advice to all schools. These changes are detailed further below.<\/li>\n<li>Year 11 Exams will be run at school under normal exam conditions. Arrangements for other year levels’ exams will remain as planned for remote learning.<\/li>\n<li>We encourage boys to begin getting back into their regular school routines as we approach our return to school.<\/li>\n<li>The format of our Semester 1 reports will be updated to reflect this term’s remote learning environment. Reports will be released to parents and guardians on Friday 26 June.<\/li>\n<li>It is important that the College has up to date and accurate records to allow effective and efficient communication. Please update your contact details via PAM if required.<\/li>\n<li>The College welcomes contributions to our ‘Moment in Time’ project; a reflection capturing our community’s thoughts and experiences on living through this extraordinary time.<\/li>\n<li>We reassure all families that the health and safety of all members of the community remains our number one concern.<\/li>\n<\/ul>\n<p>As we move ever closer to a return to some form of normality, I once again wish to thank you for all your support and feedback during these past few weeks of remote and flexible learning. As a community I believe we can be truly proud of what we have been able to achieve and the way we have gone about it. The whole school community has worked together very effectively and upheld our College values of integrity, belonging, joy, dynamism and respect, whilst continuing to provide a high quality education for our boys in a very different and difficult setting. We now eagerly look forward to welcoming our boys back to school.<\/p>\n<p>With the boys returning to the College, please be aware of the following arrangements:<\/p>\n<p><strong>Return to School<\/strong><\/p>\n<ul>\n<li>Monday 25 May will be a student-free day.<\/li>\n<li>Years 11 and 12 VCAL and VCE students will return to school from Tuesday 26 May. This also includes Year 10 students undertaking VCE and VET studies.<\/li>\n<li>Year 10 boys are expected to attend their VCE subject where practicable. If this is not possible for your child\/children, our teachers will make sure the work provided to students attending at school is also provided to your child\/children.<\/li>\n<\/ul>\n<p><strong>Supervision at School <\/strong><\/p>\n<ul>\n<li>Year 10 students coming in for their scheduled VCE\/VET classes can be supervised at school for the remainder of the day. Parents are asked to inform the College via Student Reception of their son’s arrangements:\n<ul>\n<li>If they are <strong>only<\/strong> <strong>attending<\/strong> their VCE\/VET classes<\/li>\n<li>If they are <strong>not attending<\/strong> the College<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><strong>Please note:<\/strong> There is no need to contact the College if you son is attending his classes and will be at the College for supervision for the whole day.<\/p>\n<ul>\n<li><strong>All other year levels will return to school from Tuesday 9 June.<\/strong><\/li>\n<li>For those students who cannot be supervised at home and vulnerable children, including Year 10 students staying on at school for whole or part days after their VCE class, the existing model of supervision will remain in place during the two-week period from Tuesday 26 May to Tuesday 9 June.<\/li>\n<li>The current process asks parents and carers to indicate the days or part-days for which onsite supervision is required. Please email <a href=\"mailto:welcome@salesian.vic.edu.au\">welcome@salesian.vic.edu.au<\/a> or contact Mary Menz.<\/li>\n<li>From 26 May all students attending the College for classes or supervision must wear their full school uniforms.<\/li>\n<li>All other students at Years 7 – 10 levels will continue learning from home until their return on Tuesday 9 June.<\/li>\n<\/ul>\n<p><strong>Discontinuing Remote Learning<\/strong><\/p>\n<ul>\n<li>Once a year level has returned, all students will be expected to attend school as normal. This means if you choose to keep your child\/children home after their year level has returned to onsite schooling, we can no longer support their learning from home.<\/li>\n<li>This does not apply to children who need to be absent for health or medical reasons. For those families, please contact us so we can make an appropriate plan.<\/li>\n<li>This same approach is being taken by all Catholic and Government schools in Victoria.<\/li>\n<\/ul>\n<p><strong>Risk Minimisation <\/strong><\/p>\n<p>Whilst the Chief Health Officer’s advice is that students will not be required to maintain physical distancing at school, there will be a number of other important changes to our school operations, consistent with health advice to all schools, that will minimise risks of contamination including:<\/p>\n<ul>\n<li>Adjusted arrangements for drop-off and pick-up, with parents asked not to leave their vehicle unless they have school business to which they need to attend.<\/li>\n<li>The way we conduct parent–teacher meetings and interviews will be in line with current advice.<\/li>\n<li>Students need to show awareness of the current conditions and employ safe, hygienic measures at all times.<\/li>\n<li>A strict hands off policy will be in place to minimize contact between students, who will be asked to maintain a suitable social distance in the school yard.<\/li>\n<li>Classroom set up will maximise the distance between students.<\/li>\n<li>Students will need to bring drink bottles to school as communal drinking fountains will not be available.<\/li>\n<li>Minimising property access available to any person other than staff and students. We ask all parents to please consider your need to access the school site and communicate electronically or by phone if you need to speak to someone at school.<\/li>\n<li>School drop off and pick-ups by parents will continue as normal.<\/li>\n<li>To support the health and wellbeing of all students and staff, our school will introduce an enhanced cleaning routine.<\/li>\n<li>Students will be asked to wipe down their work spaces and equipment and sanitise their hands at the start of every lesson.<\/li>\n<li>We will also encourage frequent handwashing. Supplying your son with a personal supply of hand sanitizer is recommended.<\/li>\n<li>If your son becomes unwell whist at school, he will be isolated. You will be contacted immediately and asked to come to the College to pick him up as soon as possible.<\/li>\n<li>If your child is ill or is feeling unwell, they must not attend school. They must remain home and seek medical advice.<\/li>\n<li>Public Transport: We encourage you to consider alternative arrangements for public transport.<\/li>\n<\/ul>\n<p><strong>Exams<\/strong><\/p>\n<ul>\n<li>Year 11 Exams will be run at school under normal exam conditions.<\/li>\n<li>Arrangements for other year levels will remain as planned for remote learning.<\/li>\n<\/ul>\n<p><strong>Other important considerations to note:<\/strong><\/p>\n<ul>\n<li>No student supervision will be available at the College on our student free day on Monday May 25.<\/li>\n<li>Charter buses will be back as normal from Tuesday 26 May.<\/li>\n<li>Boys will be required to return to the College in full school uniform and in strict compliance with the College Uniform Code in relation to appearance, facial hair and hair style.<\/li>\n<li>As we have been directed to cancel all sport there will be no sport afternoons, and therefore there will be no need for the boys to wear their sport uniforms to school.<\/li>\n<li>Supervised private study will replace sport afternoons.<\/li>\n<li>Boys will still be expected to bring their sports uniforms in for participation in PE classes.<\/li>\n<\/ul>\n<p><strong>Important Information from Academy Uniforms:<\/strong><\/p>\n<ul>\n<li><em>“Given that most students have yet to purchase their winter uniforms, we are concerned about the volume of families that will be visiting our store closer to the return to school date and the implications that this will have regarding the social distancing. We have a store capacity that we cannot exceed, and parents will be asked to wait outside or in their cars when the limit has been reached. <\/em><em>Our Springvale store is open with normal trading hours and we recommend visiting sooner rather than later. We are fully stocked and adhering to social distancing and disinfecting all surfaces between sales. There are currently no queues, so parents will be served immediately, but this will change once we approach the return to school date.”<\/em><\/li>\n<\/ul>\n<p><strong>Assessment<\/strong><\/p>\n<p>As a school we moved to remote learning as a result of COVID-19, and therefore our usual ways of working and engaging with students have looked different in Term 2. Included in this change has been how we assess and report on student learning.<\/p>\n<p>The Semester 1 report will look slightly different from usual. Following the advice of the Victorian Curriculum and Assessment Authority (VCAA), Victorian Department of Education and Training, and the Catholic Education Commission of Victoria Ltd (CECV), this report will provide:<\/p>\n<ul>\n<li>A description of the areas of the Victorian Curriculum F–10 taught in Semester 1.<\/li>\n<li>A succinct assessment of student learning achievement, based on the Achievement Standards in the Victorian Curriculum F–10 and, where possible, progress.<\/li>\n<li>An additional comment providing an indication on how your child has adjusted to the remote and flexible learning environment, with reference to the ‘Personal and Social Capability’ curriculum.<\/li>\n<\/ul>\n<p>We thank you for your understanding of the addition to the Semester 1 reports, as impacted by the change in learning environments this term, and of the approach to continuity of learning that our school has taken.<\/p>\n<p>Please note Semester 1 reports will be released to parents and guardians on Friday 26 June.<\/p>\n<p><strong>Routine <\/strong><\/p>\n<p>We strongly encourage all boys to take this time to get back into a regular ‘school day’ routine. This may include setting their alarm earlier, organising their school bag and resources in advance, and getting enough sleep the night before school. Families are also encouraged to consider transport options to and from the College, and explore alternatives other than public transport where possible.<\/p>\n<p>There will be no change to the start and end of the College day. We expect to see an increase in boys being transported to and from school. If you are contemplating this, please consider dropping off and picking up your sons in the surrounding streets, rather than on the College grounds, or dropping them off earlier in the morning.<\/p>\n<p>If public transport is the only option, then boys should plan their journeys now to ensure that they are at the College on time and ready to learn. The College expectations on punctuality and attendance will be in full effect from the first day back from remote learning.<\/p>\n<p><strong>Contact Details<\/strong><\/p>\n<p>It is important that the College has up to date and accurate records to allow effective and efficient communication.<\/p>\n<p>Please log in to your PAM account and ensure that your details are verified. Please download the Simon Everywhere App to receive notifications.<\/p>\n<p><strong>‘Moment in Time’ Project<\/strong><\/p>\n<p>The College would like to create our own ‘Moment in Time’; a project to capture our experiences and thoughts during the Covid 19 period.<\/p>\n<p>We are currently living through extraordinary times, and even as restrictions ease, life is radically different for all of us.<\/p>\n<p>We welcome you to share your thoughts, pictures and videos about how you’re thinking, feeling, living, attending classes and working through this experience. What are you feeling? What does home or work look like? What have you learned during this time?<\/p>\n<p><strong>We’re looking for photos, videos and diary entries about themes such as:<\/strong><\/p>\n<ul>\n<li>What have you learned from this experience?<\/li>\n<li>What does your home or work life look like at the moment?<\/li>\n<li>How are you thinking or feeling about things now? Are you optimistic, anxious, impatient, or relaxed? What are you missing? What will be different for you on the other side of this?<\/li>\n<li>What would you like to tell your future self about this period?<\/li>\n<li>Any highlights of remote learning.<\/li>\n<li>Funny things you have done.<\/li>\n<\/ul>\n<p>Contributions to our collection are most welcome from all members of the College community.<\/p>\n<p>Please email your items to <a href=\"mailto:welcome@salesian.vic.edu.au\">welcome@salesian.vic.edu.au<\/a> and please contact us if you wish to discuss.<\/p>\n<p>We understand that some families may feel anxious about the move back to classroom teaching and learning. I wish to reassure all families that the health and safety of all members of the community remains our number one concern. We will be doing everything we can to minimise the risk of compromising this. I can assure you that this decision has been taken on the basis of the best health advice available to our state.<\/p>\n<p>More information about the return to school and coronavirus (COVID-19) can be found on the CECV website, which will continue to be updated: <a href=\"http:\/\/www.cecv.catholic.edu.au\/Coronavirus-information-for-parents\">www.cecv.catholic.edu.au\/Coronavirus-information-for-parents<\/a>.<\/p>\n<p>Thank you for your continued support and patience during this time. We look forward to welcoming students back to the classroom. If you have any questions or concerns regarding the return to school, please contact the College.<\/p>\n<p><strong>Robert Brennan<br>\n<\/strong>Principal<\/p>\n<p><strong>COVID-19 Update – Friday 15 May 2020 <\/strong><\/p>\n<p><strong>Summary: <\/strong><\/p>\n<ul>\n<li>We thank parents for supporting the College during the last few weeks of remote learning<\/li>\n<li>The Chief Health Officer, the Victorian Government and the Catholic Education Commission of Victoria Ltd (CECV) have advised that schools can begin a phased return to onsite schooling<\/li>\n<li><strong>First Stage:<\/strong> Years 11 and 12 VCE and VCAL students will return to school from<strong> Tuesday 26 May.<\/strong> Year 10 students undertaking VCE studies (including VET studies) are also able to attend school for those classes where practicable<\/li>\n<li><strong>Second Stage:<\/strong> All other year levels to return from <strong>Tuesday 9 June<\/strong><\/li>\n<li>From Tuesday 26 May to Tuesday 9 June, onsite supervision will continue to be available to students who cannot be supervised at home<\/li>\n<li>Once a year level has returned, all students will be expected to attend school as normal. If you choose to keep your child\/children home after their year level has returned to onsite schooling, they will not be supported in learning from home. This does not apply to children who need to be absent for health or medical reasons<\/li>\n<li>There will be a number of important changes to our school operations, consistent with health advice (detailed further below)<\/li>\n<\/ul>\n<p>Thank you for supporting the College during these last few weeks of remote learning.<\/p>\n<p>The Chief Health Officer, the Victorian Government and the Catholic Education Commission of Victoria Ltd (CECV) have advised that schools can begin a phased return to onsite schooling.<\/p>\n<p>In the <strong>first stage<\/strong>, our senior secondary students (Years 11 and 12 VCAL and VCE) will return to school from<strong> Tuesday 26 May.<\/strong><\/p>\n<p>Year 10 students undertaking VCE studies, including VCE\/VET studies, will also attend school for those classes where practicable. If this is not possible for your child\/children, our teachers will make sure the work provided to students attending at school is also provided to your child\/children. However, please remember that teachers will only be asked to provide one form of teaching, which will be either face to face or remote. It is not possible for them to do both. Year 10 students unable to travel home at the end of their scheduled VCE\/VET classes may be supervised at school for the remainder of the day.<\/p>\n<p>To support all school staff to prepare for this transition, Monday 25 May will be a student free day.<\/p>\n<p>In the <strong>second stage<\/strong> of our return to onsite schooling, all other year levels will return to school from<strong> Tuesday 9 June.<\/strong><\/p>\n<p>For those students who cannot be supervised at home and vulnerable children, the existing model of onsite schooling will remain in place during the two week period from Tuesday 26 May to Tuesday 9 June. The current process that we are using to enable parents and carers to indicate the days or part-days for which onsite schooling is required will continue for this two week period. All other students in those year levels will continue learning from home until Tuesday 9 June.<\/p>\n<p>Once a year level has returned, all students will be expected to attend school as normal. This means that if you choose to keep your child\/children home after their year level has returned to onsite schooling, we can no longer support their learning from home.<\/p>\n<p>This does not apply to children who need to be absent for health or medical reasons. For those families, please contact us so we can make an appropriate plan.<\/p>\n<p>This same approach is being taken by all Catholic and Government schools in Victoria.<\/p>\n<p>Between Tuesday 26 May and 9 June, where teachers returning to school have school-aged children in Grade 3 to Year 10 for whom at-home arrangements cannot be made, those children can attend the school at which they are enrolled.<\/p>\n<p>To support the health and wellbeing of all students and staff, our school will continue with an enhanced cleaning routine and will encourage frequent handwashing.<\/p>\n<p>If your child is ill or is feeling unwell, they <strong>must not attend<\/strong> school. They must remain home and seek medical advice.<\/p>\n<p>While the Chief Health Officer has advised that students will not be required to maintain physical distancing at school, there will be a number of important changes to our school operations, consistent with health advice to all schools that will be made available in coming days. These will apply until further notice. I will provide more details about our local school context as soon as possible, but it is important to note that changes will include:<\/p>\n<ul>\n<li><strong>Adjusted arrangements for drop-off and pick-up:<\/strong> Parents are asked not to leave their vehicle parked in the school grounds unless they have school business to which they need to attend.<\/li>\n<li><strong>Restrictions on access to the school site<\/strong> for anyone other than immediate school staff and students<\/li>\n<li><strong>The way we conduct parent–teacher meetings and interviews<\/strong><\/li>\n<li><strong>Students will need to bring drink bottles <\/strong>to school as communal drinking fountains will not be available.<\/li>\n<li><strong>A strict hands off policy<\/strong> will be in place to minimize contact between the boys.<\/li>\n<\/ul>\n<p>We understand that some families may feel anxious about this move back to classroom teaching and learning. I can assure you that this decision has been taken on the basis of the best health advice available to our state.<\/p>\n<p>More information about the return to school and coronavirus (COVID-19) can be found on the CECV website, which will continue to be updated: <a href=\"http:\/\/www.cecv.catholic.edu.au\/Coronavirus-information-for-parents\">www.cecv.catholic.edu.au\/Coronavirus-information-for-parents<\/a>.<\/p>\n<p><strong>Other important considerations to note:<\/strong><\/p>\n<ul>\n<li>Boys who require supervision on our class free day on Friday 15 May are able to come to the College for supervision in the Library.<\/li>\n<li>The Charter Bus will run as normal from Tuesday 26 May.<\/li>\n<li>Boys will be required to return to the College in full school uniform and in strict compliance with the College Uniform Code in relation to appearance, facial hair and hair style.<\/li>\n<li><strong>Important information from Academy Uniforms: <\/strong><em>“Given that most students have yet to purchase their winter uniforms, we are concerned about the volume of families that will be visiting our store closer to the back to school date and the implications that this will have regarding the social distancing. We have a store capacity that we cannot exceed, and parents will be asked to wait outside or in their cars when the limit has been reached. Our Springvale store is open with normal trading hours and we recommend visiting sooner rather than later. We are fully stocked and adhering to social distancing and disinfecting all surfaces between sales. There are currently no queues so they will be served immediately but this will change once we approach the return to school date. Online purchasing is available at all times.”<\/em><\/li>\n<li>Year 11 Exams will be run at school under normal conditions. Arrangements for other year levels will remain as planned for remote learning.<\/li>\n<li>As we continue to isolate, if your son becomes unwell whilst at school you will be contacted immediately and requested to come to the College to pick him up as soon as possible.<\/li>\n<\/ul>\n<p>Thank you for your continued support and patience during this time. We look forward to welcoming students back to their classrooms. If you have any questions or concerns regarding our return to school, please contact the College.<\/p>\n<p><strong>Robert Brennan<br>\n<\/strong>Principal<\/p>\n<p> <\/p>\n<p><strong>COVID-19 Update – Wednesday 6 May 2020<\/strong><\/p>\n<p><strong>Summary: <\/strong><\/p>\n<ul>\n<li>Salesian College continues to follow the advice of the Victorian Government by enacting our Continuity of Learning Plan<\/li>\n<li>We thank parents for assisting students with their learning, supporting teachers and staying connected to the College community.<\/li>\n<li>The College is awaiting guidance from the Victorian Government and Catholic Education Melbourne on a return to school date<\/li>\n<li>Families were emailed further details of our Teaching and Learning plans for the remainder of Term Two. Key points of these plans are detailed below<\/li>\n<li>The Catholic Education Office released an educational video on supporting students’ mental health during COVID-19.<\/li>\n<li>The second edition of Catholic Education Today for 2020 is now available<\/li>\n<\/ul>\n<p>As we near the end of Week 4 of remotely delivering our Continuity of Learning Plan, we wish to thank parents for assisting their sons with their learning, for supporting our teachers during this unprecedented time, for communicating positive feedback and for assisting us in ensuring our students remain connected to the College Community.<\/p>\n<p>We are still unsure of a return to school date, and are awaiting further guidance from the Victorian Government and Catholic Education Melbourne. This information will be communicated to families as soon as possible.<\/p>\n<p>Salesian College continues to follow the advice of the Victorian Government by enacting our Continuity of Learning Plan. Families were emailed further details of our plans for the progression of remote learning in Term Two. Key points of these plans are detailed below.<\/p>\n<p><strong>Teaching and Learning Update<\/strong><\/p>\n<p><strong>Years 7 to 9 <\/strong><\/p>\n<p><strong>Assessment: <\/strong><\/p>\n<ul>\n<li>Year 7-9 Examinations will not be conducted in the traditional manner. Examinations will be replaced by ‘alternate tasks’ to be completed during class time during Week 9 this term. These tasks will consist of a review of the semester’s learning and include a series of higher order tasks.<\/li>\n<li>This will apply to the following subjects:<br>\n<strong>Year 7:<\/strong> English<br>\n<strong>Year 8:<\/strong> English, Mathematics, Science<br>\n<strong>Year 9:<\/strong> English, Mathematics, Humanities, Science<\/li>\n<\/ul>\n<p><strong>Key Dates:<\/strong><\/p>\n<ul>\n<li><strong>‘Catch Up Day’, Friday 15<\/strong> <strong>May:<\/strong> No formal classes. Teaching staff will be available on this day to support students in completing any outstanding classwork.<\/li>\n<li><strong>Revision and Consolidation:<\/strong> Term 2 Week 8 (Monday 1 June – Friday 11 June) Examination ‘Alternate Tasks’ will be conducted during this time.<\/li>\n<li><strong>Queen’s Birthday Public Holiday, <\/strong><strong>Monday 8 June:<\/strong> No Classes<\/li>\n<li><strong>Staff Professional Practice Days, Thursday 11<\/strong> <strong>and Friday 12 June:<\/strong> No Classes<\/li>\n<li><strong>Start of Semester 2, Term 2 Week 10: <\/strong>Monday 15 June<\/li>\n<\/ul>\n<p><strong>Years 10-11<\/strong><\/p>\n<p><strong>Assessment: <\/strong><\/p>\n<ul>\n<li><strong>Year 10-11 Examinations<\/strong> will proceed as scheduled in Weeks 7 &amp; 8 this term (Friday 29 May – Friday 5 June).<\/li>\n<li>These examinations are intended to provide Years 10 and 11 students with an authentic learning experience in preparation for VCE and subject selection.<\/li>\n<li>Examinations will be undertaken remotely. The daily timetable will be replaced by an examination timetable. All other time within the examination schedule will be allocated to revision and study.<\/li>\n<li>The timing of the examinations and nature of the task will be adjusted to suit the remote learning environment. Examinations will contain higher order tasks that will not require parental supervision.<\/li>\n<li>Students will receive an examination timetable in due course.<\/li>\n<\/ul>\n<p><strong>Key Dates <\/strong><\/p>\n<ul>\n<li><strong>‘Catch Up Day’, Friday 15<\/strong> <strong>May:<\/strong> No formal classes. Teaching staff will be available on this day to support students in completing any outstanding classwork.<\/li>\n<li><strong>Revision and Consolidation:<\/strong> Term 2 Week 7 (Monday 25 May – Thursday 28 May)<\/li>\n<li><strong>Examination Period:<\/strong> Term 2 Week 7 and 8 (Friday 29 May – Friday 5 June)<\/li>\n<li><strong>Queen’s Birthday Public Holiday, <\/strong><strong>Monday 8 June:<\/strong> No Classes<\/li>\n<li><strong>Staff Professional Practice Days, Thursday 11<\/strong> <strong>and Friday 12 June:<\/strong> No Classes<\/li>\n<li><strong>Start of Semester 2, Term 2 Week 9: <\/strong>Tuesday 9 June<\/li>\n<\/ul>\n<p><strong>Year 12 <\/strong><\/p>\n<ul>\n<li>The Victorian Curriculum and Assessment Authority (VCAA) have provided the following advice on the 2020 VCE and VCAL in response to the COVID-19 pandemic<\/li>\n<li>VCE students will still receive an ATAR<\/li>\n<li>Unit 3 study has been extended by two weeks<\/li>\n<li>Unit 4 will commence on 9 June 2020 (Week 9)<\/li>\n<li>The GAT will move from June to October or November<\/li>\n<li>End of year exams will be postponed until December. VCAA is currently considering a compressed exam schedule and shortened exams<\/li>\n<li>School based assessment tasks are being reduced where possible<\/li>\n<li>Practical work may be delayed. In some subjects, practical activities may be replaced with simulations to generate primary data<\/li>\n<li>Some practical subjects may be required to attend classes on campus if learning requirements cannot be fulfilled at home. In these cases, families will be notified individually and social distancing protocol will be observed.<\/li>\n<li>VCAL students will have more time to complete their courses, and this will be consistent with the revised dates for VCE<\/li>\n<li>The College is currently developing a Year 12 Exam preparation program that includes opportunities for GAT preparation, trial exams, masterclasses, lectures and guest speakers. This plan will be shared with students when finalised<\/li>\n<\/ul>\n<p><strong>Key Dates <\/strong><\/p>\n<ul>\n<li><strong>‘Catch Up Day’, Friday 15<\/strong> <strong>May:<\/strong> No formal classes. Teaching staff will be available on this day to support students in completing any outstanding classwork.<\/li>\n<li><strong>Queen’s Birthday Public Holiday, <\/strong><strong>Monday 8 June:<\/strong> No Classes<\/li>\n<li><strong>Staff Professional Practice Days, Thursday 11<\/strong> <strong>and Friday 12 June:<\/strong> No Classes<\/li>\n<\/ul>\n<p><strong>Wellbeing Resource<\/strong><\/p>\n<p>The College is committed to supporting the wellbeing of students and families through this difficult time. We wish to share the below educational resource from the Catholic Education Office, featuring Dr Michael Carr-Gregg. The video discusses supporting the mental health of secondary school students during COVID-19.<\/p>\n<p>The video can be viewed <a href=\"https:\/\/schooltv.me\/wellbeing_news\/special-report-wellbeing-checklist-secondary\">here.<\/a><\/p>\n<p><strong>Catholic Education Today <\/strong><\/p>\n<p>The second edition of Catholic Education Today for 2020 is now available on the Catholic Education Melbourne website. The Term 2 edition focuses on <strong>‘Keeping the Light of Christ’<\/strong>, with articles that reflect Catholic schools’ point of difference: from supporting local communities by providing fee-relief, to promoting slavery-free resources to make a difference on a global level.<\/p>\n<p>Click here to <a href=\"https:\/\/www.cem.edu.au\/News-Events\/Catholic-Education-Today.aspx\">read.<\/a><\/p>\n<p>Stay safe, and stay connected.<\/p>\n<p><strong>Rob Brennan<\/strong><br>\nPrincipal<\/p>\n<p><strong>COVID-19 Update – Friday 1 May 2020 <\/strong><\/p>\n<p><strong>Summary: <\/strong><\/p>\n<ul>\n<li>The College is committed to continuing to support families as we all adapt to this new way of working, learning and living.<\/li>\n<li>The College has developed a Continuity of Learning Guide to support both parents and students during this time of remote learning.<\/li>\n<li>We pray for a return to normal College life as soon as possible.<\/li>\n<\/ul>\n<p>Salesian College is committed to continuing to support families as we all adapt to this new way of working, learning and living. We understand the difficulties that families may be experiencing at this time, balancing the responsibilities of running a household with remote learning.<\/p>\n<p>We have produced a ‘Continuity of Learning’ Guide to support both you and your son during this time of remote learning. Your son has received our <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/05\/Student-Guide.pdf\">Student Support Guide<\/a>, relating to his learning and wellbeing.<\/p>\n<p>Our <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/05\/Parent-Guide.pdf\">Parent Support Guide<\/a> has been developed to support you in quickly identifying how your son’s remote learning school day works, how you can support his learning, our Student Wellbeing check in process, Microsoft Teams Tips and a Student Guide to Successful Learning.<\/p>\n<p>We encourage you to print our Student and Parent Guides and display them in your son’s learning space.<\/p>\n<p>We pray that we can resume our mission of educating and nurturing students here at the College as soon as possible.<\/p>\n<p><strong>COVID-19 Update – Thursday 9 April 2020<\/strong><\/p>\n<p><strong>Summary <\/strong><\/p>\n<ul>\n<li>Community urged to continue isolation, reiterating <a href=\"https:\/\/www.premier.vic.gov.au\/wp-content\/uploads\/2020\/04\/200407-Victorian-Students-To-Learn-From-Home-As-VCE-Timelines-Revised.pdf\">instructions by Premier Daniel Andrews<\/a>, on Tuesday, 7 April 2020<\/li>\n<li>Remote Learning Plan to commence Period One, Wednesday April 15<\/li>\n<li>Scheduled class time will continue to run, answering questions and providing needed clarification<\/li>\n<li>Teachers to following their normal timetable to the best of their ability. We ask for understanding and leniency as demands on staff are understood during this time<\/li>\n<li>All resources will be available on <a href=\"https:\/\/simon.salesian.vic.edu.au\/CookieAuth.dll?GetLogon?curl=Z2F&amp;reason=0&amp;formdir=2\">Simon<\/a><\/li>\n<li>At all times when staff and students MUST be at the College, appropriate social distancing and hygiene measures will be in place. Unwell students and staff must be excluded.<\/li>\n<li>The College will be available to students who are unable to remain at home to study remotely<\/li>\n<li>Expectation is this will be very few in number and will be limited to students with exceptional special circumstance<\/li>\n<li>Live classes cannot and will not take place at school<\/li>\n<li>Supervision at school will be undertaken by Library Staff and Learning Support Officers<\/li>\n<li>Normal services provided for the boys i.e. canteen, charter buses or the like will not run<\/li>\n<li>Boys in attendance are not expected to wear College uniform<\/li>\n<li>Specific Year 12 details will be communicated in the coming days<\/li>\n<li>We ask God to bless our College community and keep us all safe and healthy over the coming Easter break. We pray that we can soon return to normal College life and resume our mission of educating and nurturing students here at the College.<\/li>\n<\/ul>\n<p>As communicated by Premier Daniel Andrews on Tuesday, 7 April 2020, all students will remain at home and study remotely for all of Term 2 a part from exceptional circumstances.<\/p>\n<p><em>“As we act to slow the spread of coronavirus, the message to students and parents of government schools is clear: all children who <strong>can<\/strong> learn at home <strong>mus<\/strong>t learn from home – with exceptions only in extremely limited circumstances.”<br>\n– Premier Daniel Andrews.<\/em><\/p>\n<p>With details now confirmed both by the Government and CEM, we can now confirm details that will take place in the coming weeks. I refer you back to our Continuity of Learning Plan we sent out to families in the last week of Term One as this will provide the basis of what is to transpire.<\/p>\n<p>The outline of our program is as follows:<\/p>\n<ul>\n<li>Classes will start from period one on Wednesday April 15.<\/li>\n<li>Teachers will connect live with students early in the week to set the program for the week ahead and to direct students to the teaching and learning materials.<\/li>\n<li>Students will then work their way through the material over the week checking in with their teacher as required for further directions or clarification.<\/li>\n<li>Teachers will again check in live with their students late in the week to see how they have progressed with teaching and learning activities.<\/li>\n<li>Teachers will make themselves available to their students in scheduled class time to answer emails and provide and clarifications required.<\/li>\n<li>Teachers to following their normal timetable to the best of their ability. We ask for understanding and leniency as demands on staff are understood during this time.<\/li>\n<li>As stated in the Continuation of Learning Plan, all resources will be available on <a href=\"https:\/\/simon.salesian.vic.edu.au\/CookieAuth.dll?GetLogon?curl=Z2F&amp;reason=0&amp;formdir=2\">Simon<\/a>.<\/li>\n<li>At all times when staff and students MUST be at the College, appropriate social distancing and hygiene measures will be in place. Unwell students must be excluded.<\/li>\n<\/ul>\n<p>The College will be available to students who are unable to remain at home to study remotely. The expectation is this will be very few in number and will be limited to students with exceptional special circumstances. Boys in attendance at the College are not expected to wear school uniform.<\/p>\n<p>It is important to understand that teachers will be at home delivering the remote program, therefore the supervision at school will be undertaken by Library Staff and Learning Support Officers. Students coming into school will access the remote learning provided by their teachers whilst under the supervision of support staff.<\/p>\n<p>Normal services provided for the boys i.e. canteen, charter buses or the like will not run.<\/p>\n<p>We recognise that Year 12 students will have specific questions. These Year 12 details will be communicated in the coming days.<\/p>\n<p>I wish to remind all our students that they are not alone in this journey and that when we are able to adjust and adapt quickly, we will notice the greatest success.<\/p>\n<p>We ask God to bless our College community and keep us all safe and healthy over the coming Easter break. We pray that we can soon return to normal College life and resume our mission of educating and nurturing students here at the College.<\/p>\n<p><strong>Rob Brennan<\/strong><br>\nPrincipal<\/p>\n<p><strong>COVID-19 Update – Monday 6 April 2020<\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>The College currently has two plans for the beginning Term 2:<br>\n<strong>Plan A:<\/strong> For a full return, as normal (unlikely), and<br>\n<strong>Plan B:<\/strong> For initiating our Remote Learning Plan<\/li>\n<li>Once the Government and Catholic Education Melbourne confirms further details, the College will communicate next week’s plan.<\/li>\n<li>In the likely case that we are required to deliver remote learning, the College will also provide supervision at school for those students unable to remain at home. In this case, students at school will be supervised by  College Support Staff.<\/li>\n<li>We ask that families who are likely to send their sons to school for supervision contact us, so that we can make appropriate arrangements. (Qualification criteria to be advised)<\/li>\n<li>The College encourages all families to download the SIMON Everywhere App, as this allows for easy access to updates.<\/li>\n<li>We invite families to join us in prayer on Good Friday at 3pm. We have provided Fr Lawrie Moate’s Prayer Service for those who wish to participate.<\/li>\n<li>We wish the College community God’s blessings during this Holy Easter season, and pray that we are all able to return to the College as soon as practicable.<\/li>\n<\/ul>\n<p><strong>Planning for Term Two<br>\n<\/strong>We continue to monitor advice from both the Government and Catholic Education Melbourne (CEM). The College currently has two plans for the commencement of Term Two:<br>\n<strong>Plan A: <\/strong>For a full return (although we believe this is not likely), and;<br>\n<strong>Plan B:<\/strong> For the initiation of our Remote Learning Plan, as previously communicated.<br>\nOnce further details are confirmed by Goverment and CEM, we will communicate the plan we will follow next week. It is likely that the College will be required to deliver remote learning, as well as provide supervision for students unable to remain at home. In this case, the College is unable to deliver classes both online and at school. Given that teachers will be required to deliver their curriculum remotely from home, students at school will be supervised by College Support Staff. We ask families who are likely to send their sons to school for supervision, to contact us so that we can make appropriate arrangements (qualification criteria applies). We thank you for your patience and support during this difficult time.<\/p>\n<p><strong>Good Friday Prayer Network<\/strong><\/p>\n<p>During this difficult time, we invite families who would like to participate to our Good Friday Prayer Network at 3pm. Please read Fr Lawrie Moate’s letter and Prayer Service <a href=\"https:\/\/www.salesian.vic.edu.au\/2020\/04\/good-friday-community-prayer\/\"><strong>here.<\/strong><\/a><\/p>\n<p><strong>Communication – SIMON Everywhere <\/strong><\/p>\n<p>The College endeavours to keep families, students and staff informed. Push notifications are currently being sent through the Simon Everywhere App. We encourage families to download this app, as this allows for quick and easy access to updates.<\/p>\n<p>We wish the College community God’s blessings during this Holy Easter season, and pray that we are all able to return to the College as soon as practicable.<\/p>\n<p><strong>COVID-19 Update – Wednesday 1  April 2020<\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>College Office closed, Friday 3 April (College phone accessible during this time)<\/li>\n<li>College to reopen with reduced Administration staff on Monday 6 April from 8:00am – 4:00pm<\/li>\n<\/ul>\n<p>The College continues to monitor and follow current advice from Government and Catholic Education Melbourne and will continue to update all in the Community on a regular basis.<\/p>\n<p>On Friday, 3 April the College Office will be closed as Administration staff trial working from home. The phone will be diverted and calls will be answered and addressed. Please leave a message if your call is not answered and the College will get back to you.<\/p>\n<p>As it currently stands, the College Office will open with reduced Administration staff on Monday, April 6 from 8:00am until 4:00pm.<\/p>\n<p>We thank our community for working with us during this difficult time.<\/p>\n<p><strong>COVID-19 Update – Friday 27 March 2020 (End of Term One) <\/strong><\/p>\n<p><strong>Summary: <\/strong><\/p>\n<ul>\n<li>The College has upskilled staff and reviewed infrastructure to deliver remote learning for students, in readiness for a school shutdown (if this occurs)<\/li>\n<li>We remind students to prepare their resources and exercise discipline in their studies, so that we are able to collectively maximise remote learning in Term 2.<\/li>\n<li>We publically acknowledge and congratulate our staff and community for working with us to creatively adapt to the trying time we are facing.<\/li>\n<li>Parents have been provided with our Remote Learning Plan. We encourage families to become familiar with this plan, to enable us to best support the boys in their learning, in the event that this plan needs to be engaged<\/li>\n<li>While a plan is in place for the event of a school shutdown, the advice to date is that we will resume daily school operations on Wednesday 15 April (Term Two). Any change to this will be advised as soon as possible.<\/li>\n<li>A great spirit of connectedness has been evident during this time, in a variety of ways. We acknowledge Year 7 parent, Nicola Howard who generously designed the below infographic to connect our community and best support the boys during the forecasted remote learning period.<\/li>\n<li>We ask God to bless our College community and keep us all safe and healthy over the coming Easter break. We pray that we can soon return to normal College life and resume our mission of educating and nurturing students here at the College.<\/li>\n<\/ul>\n<p><strong>Preparing for Remote Learning<\/strong><\/p>\n<p>We encourage students to use the school holidays to prepare themselves both practically and mentally for the term ahead, as we sail into the uncharted waters of remote learning. The College has spent a lot of time upskilling staff and reviewing our infrastructure to ensure we are in a position to deliver remotely. We are confident that everything is in place, and our success will now rely on the dedication of our students to be disciplined in accessing their learning from home. We would like to publicly acknowledge, congratulate and thank our staff and community for the manner in which they have entered into this period of time and undertaken the tasks that have needed to be completed, as we are now well equipped to tackle this crisis.<\/p>\n<p>Parents have been provided with the information outlining our plan for remote delivery. We encourage families to familiarize themselves with this plan, to enable them to support and guide their sons through this difficult time, as we all prepare for the event that schools are closed.<\/p>\n<p><strong>Term Two Commencement <\/strong><\/p>\n<p>The College is planning for Term Two to commence on Wednesday 15 April 2020, with all boys returning on this day unless we are otherwise advised. Any changes to current advice will be communicated as soon as possible to the College Community.<\/p>\n<p><strong>Spirit of Cooperation<\/strong><\/p>\n<p>At this time there is great evidence of people helping each other through these difficult times. A great spirit of cooperation has been evident, and demonstrated by many in the College community. We wish to thank and acknowledge the work of Year 7 parent Nicola Howard, who has designed the below graphic to help families to understand our remote learning expectations, should we need to enact our plan.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-10414 img-fluid\" src=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/03\/Slide1.jpg\" alt=\"\" width=\"1280\" height=\"720\" srcset=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/03\/Slide1.jpg 1280w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/03\/Slide1-300x169.jpg 300w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/03\/Slide1-1024x576.jpg 1024w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/03\/Slide1-768x432.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"><\/p>\n<p><strong>Principal’s Easter Blessing<\/strong><\/p>\n<p><em>“May God bless you all, and keep you safe and healthy over the coming months. Let us pray that this ordeal comes to an end sooner rather than later, that we can all return to some form of normality, and that the boys can return to school and we can once again take up our mission of educating and nurturing them here at the College.”<\/em><\/p>\n<p><strong>Robert Brennan<\/strong><br>\nPrincipal<\/p>\n<p> <\/p>\n<p><strong>COVID-19 Update – Monday 23 March 2020<br>\n<\/strong><\/p>\n<p><strong>Summary:<\/strong><\/p>\n<ul>\n<li>Term 1 holidays to commence, Tuesday 24 March<\/li>\n<li>Planning in place for resuming classes, Wednesday 15 April<\/li>\n<li>Learning platforms in place for remote learning<\/li>\n<li>Guidelines to assist your son<\/li>\n<li>Accessible fee assistance for those affected<\/li>\n<\/ul>\n<p>As we work together to maintain wellbeing and learning in this trying time, we acknowledge all families who have supported the College over the past couple of weeks in these uncertain and very trying times. I commend staff who are all working diligently to provide the best possible learning, teaching and pastoral care possible.<\/p>\n<p><strong>School Holidays Tuesday 24 March – Wednesday 15 April <\/strong><\/p>\n<p>Based on the advice from Government and Catholic Education Melbourne on minimising the risk of COVID-19 transmission, Term 1 holidays will commence Tuesday 24 March for all students. Current advice indicates students will resume classes on Wednesday 15 April. Changes to current advice will be communicated as soon as possible.<\/p>\n<p><strong>Continuity of Learning<\/strong><\/p>\n<p>Staff at the College are working diligently to provide the best possible learning, teaching and pastoral care as possible.<\/p>\n<p>All boys will be asked to log on through Microsoft Teams APP on <strong>Wednesday at 9:30am<\/strong> to allow staff to test platforms. This session will be facilitated by your son’s Oratory Teacher. Boys are encouraged to email their teachers during this week.<\/p>\n<p>Measures are being put in place to ensure the continuity of the boys’ education for the possibility of either a short or long term closure. Our plans will differ in the short term for students in varying year levels:<\/p>\n<ul>\n<li><strong>Year 7 – 9<\/strong> students will commence their Easter Break Tuesday 24 March (and as directed in our Homework Policy will not receive holiday homework)<\/li>\n<li><strong>Year 10 -12<\/strong> students are expected to undertake holiday homework during the week and there is likely to be an increase due to the early finish of classes<\/li>\n<\/ul>\n<p>Staff will remain at the College this week to continue to upskill and to test the various means of delivering remote learning to the boys in the event of an extended school closure.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-10444 img-fluid\" src=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/04\/Continuity-of-Learning-Students-v3_forWeb-scaled.jpg\" alt=\"\" width=\"1521\" height=\"2560\" srcset=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/04\/Continuity-of-Learning-Students-v3_forWeb-scaled.jpg 1521w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/04\/Continuity-of-Learning-Students-v3_forWeb-178x300.jpg 178w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/04\/Continuity-of-Learning-Students-v3_forWeb-608x1024.jpg 608w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/04\/Continuity-of-Learning-Students-v3_forWeb-768x1293.jpg 768w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/04\/Continuity-of-Learning-Students-v3_forWeb-912x1536.jpg 912w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/04\/Continuity-of-Learning-Students-v3_forWeb-1217x2048.jpg 1217w, https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/04\/Continuity-of-Learning-Students-v3_forWeb-1904x3205.jpg 1904w\" sizes=\"(max-width: 1521px) 100vw, 1521px\"><\/p>\n<p><strong>What you can do to assist your son<\/strong><\/p>\n<p>To enable your son to be well prepared (if the College is forced to undertake remote delivery), please ensure that he has\/does the following:<\/p>\n<ul>\n<li>School laptop<\/li>\n<li>Internet access<\/li>\n<li>Quiet study area away from distraction including mobile phone and TV<\/li>\n<li>Logs into SIMON at the appropriate times<\/li>\n<li>Maintains appropriate behaviour expectations<\/li>\n<li>Takes Recess and Lunch time breaks<\/li>\n<li>Takes regular breaks from the screen<\/li>\n<li>Exercises<\/li>\n<li>Drinks plenty of water<\/li>\n<\/ul>\n<p>Access our step by step <a href=\"https:\/\/www.salesian.vic.edu.au\/app\/uploads\/2020\/03\/Simon-Everywhere-Instructions.pdf\">Simon Everywhere Download Instructions<\/a> and ensure you stay in the know by downloading the Simon Everywhere App for <a href=\"https:\/\/apps.apple.com\/au\/app\/simon-everywhere\/id1467854354\">iPhone<\/a> or for <a href=\"https:\/\/play.google.com\/store\/apps\/details?id=com.hordernit.simoneverywhere&amp;hl=en_AU\">Android<\/a>.<\/p>\n<p><strong>Fees and programs for families experiencing hardship<\/strong><\/p>\n<p>Although there has been no decision by Government at this time, we are aware that disruption of on-site learning is likely.  As you are aware staff will support students with remote learning programs that have been outlined and will continue to be developed.  It is therefore intended that 2020 fees will remain and deductions will be made in accordance with payment schedules set up by families.<\/p>\n<p>If your family is experiencing financial hardship during this time, we encourage you to contact our Finance Office to start the conversation about how we best support you during this time.<\/p>\n<p>The College will follow our normal financial assistance policy in the following ways:<\/p>\n<ol>\n<li>In addition to the State’s contribution, the College provides $500 for recipients of Camps Sports Excursion Fund (CSEF) assistance.  Health Care Card Holders who have not completed a form are urged to contact the College.<\/li>\n<li>Families experiencing financial strain or hardship can apply for assistance under our concessions program.  Subject to provision of sufficient information to inform a decision, fees may be reduced or deferred or terms can be extended.<\/li>\n<li>Families can contact the College if they wish to extend instalment payments e.g. to January 2021.<\/li>\n<\/ol>\n<p>The College is committed to assisting any family experiencing hardship and you are strongly urged to contact us if you are experiencing difficulties.<\/p>\n<p><strong>Support Staff<\/strong><\/p>\n<p>Learning Support staff and Wellbeing staff are available to the boys via email, Microsoft Teams and Skype.<\/p>\n<p>Administration staff will be available at the College during the holiday period if you have any questions or concerns.<\/p>\n<p>I wish you, the boys and your families all the very best during these uncertain times. I pray that all in our Community remain healthy and let us hope that we are all back together sooner rather than later.<\/p>\n<p><strong>Robert Brennan<br>\n<\/strong>Principal<\/p>\n<p> <\/p>\n<p><strong>COVID-19 Update – Friday 20 March 2020<br>\n<\/strong><\/p>\n<p>On behalf of Salesian College Chadstone, I wish to restate our commitment to the health and wellbeing of our students, staff, learning and our wider community. We also commit to providing the best possible learning opportunities for our boys.<\/p>\n<p>The coronavirus (COVID-19) outbreak has shown how interconnected we are, and that when it comes to health, we are collective in our mission.<\/p>\n<p>The health and safety of our community is of the highest priority. As a College we are carefully and regularly considering and acting on the advice from Government and Catholic Education Melbourne on minimising the risk of COVID-19 transmission. Our Leadership Team is meeting daily and continues to follow guidelines communicated to us by Government authorities to maximise best learning practice for our students. Based on advice, all scheduled large College gatherings, incursions and excursions have been cancelled until the end of Term, Friday 27 March.<\/p>\n<p>Creating a sense of ‘normal’ is important to us to stabilise wellbeing and learning. We’re working hard to maintain daily school operation while we ready our staff and students for remote learning.<\/p>\n<p>We ask that current parents refer to daily communications, outlining the College’s current COVID-19 action plan. We thank you for your understanding and working with us to achieve the best possible outcomes during this most difficult time.<\/p>\n<p>The College will continue to update the school community as any new information comes to light.<\/p>\n<p><strong>Robert Brennan<\/strong><br>\nPrincipal<\/p>\n","protected":false},"excerpt":{"rendered":"<p>COVID-19 Update – Friday 29 Octboer 2021 The Victorian Government has announced the easing of restrictions from 6:00pm on Friday 29 October, given the early achievement of the 80 per cent vaccination target. I am excited that we will soon be able to return all students back to the Bosco campus as of Wednesday 3&#8230;<\/p>\n","protected":false},"author":2,"featured_media":10351,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[43,48,11,49],"tags":[1289,1301,487,178],"acf":[],"_links":{"self":[{"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/posts\/10348"}],"collection":[{"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/comments?post=10348"}],"version-history":[{"count":0,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/posts\/10348\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/media\/10351"}],"wp:attachment":[{"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/media?parent=10348"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/categories?post=10348"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/tags?post=10348"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}