{"id":25793,"date":"2024-05-27T12:19:26","date_gmt":"2024-05-27T02:19:26","guid":{"rendered":"https:\/\/www.salesian.vic.edu.au\/?p=25793"},"modified":"2024-05-27T12:19:26","modified_gmt":"2024-05-27T02:19:26","slug":"acc-sports-report-37","status":"publish","type":"post","link":"https:\/\/www.salesian.vic.edu.au\/2024\/05\/acc-sports-report-37\/","title":{"rendered":"ACC Sports Report"},"content":{"rendered":"<p><strong>Football<br>\n<\/strong>ACC Year 7 Football<br>\nThe Year 7 football team took on  St Joseph’s FTG at St Joseph’s FTG. The boys knew it was going to be a tough match against a very strong school. However, they didn’t perform as well as they would have wanted. The final score was 185 to 8.<\/p>\n<p>ACC Year 8 Football<br>\nThe Year 8 football team faced Mazenod College at Salesian College (Bosco Oval). Knowing Mazenod’s strength in football, the boys aimed for a victory after last week’s performance. Unfortunately, they lost by 10 goals, not achieving the desired result.<\/p>\n<p>ACC Year 9 Football<br>\nThe Year 9 football team competed against De La Salle at Salesian College (Bosco Oval), needing a win to secure a finals spot later in the term. They played exceptionally well against a strong opponent, winning with a final score of 87 to 57.<\/p>\n<p>ACC Year 10 Football<br>\nThe Year 10 football team played against St. Bernard’s at St. Bernard’s College. Despite anticipating a tough match, the boys were enthusiastic about their last game of the season. However, they suffered a 101-15 loss, not achieving the desired outcome. Nonetheless, they were commended for their efforts throughout the season.<\/p>\n<p>ACC Senior Football<br>\nThe senior team faced De La Salle at RSEA Park. The boys were excited to wear their new indigenous jumpers and participate in a ceremony before the game. Although they played hard, they fell short of victory, with a final score of 64 to 24.<\/p>\n<p><strong>Soccer<br>\n<\/strong>ACC Year 7A Soccer<br>\nThe Year 7A soccer team competed against St. Bede’s (Mentone) at Bentleigh Greens Soccer Club. Despite expecting a tough match, the boys secured a strong victory with an 8-0 win.<\/p>\n<p>ACC Year 7B Soccer<br>\nThe Year 7B soccer team faced St. Bede’s (East Bentleigh), aiming to secure a top-two spot for finals. Although they performed well, they narrowly lost with a final score of 2-1.<\/p>\n<p>ACC Year 8A Soccer<br>\nThe Year 8A soccer team played against St. Bede’s (Mentone) at Bentleigh Greens Soccer Club. With a solid start, leading 1-0 at halftime, they maintained momentum and won the match 4-0.<\/p>\n<p>ACC Year 8B Soccer<br>\nThe Year 8B soccer team competed against St. Bernard’s at Salesian College (Mannix Campus). Needing a win to secure a spot for finals, the boys delivered with a solid 6-0 victory.<\/p>\n<p>ACC Year 9A Soccer<br>\nThe Year 9A soccer team faced St. Bernard’s at Gardiners Reserve Synthetic. They started and finished strong, securing a solid 3-1 victory against a formidable opponent.<\/p>\n<p>ACC Year 9B Soccer<br>\nThe Year 9B soccer team also played against St. Bernard’s at Salesian College (Mannix Campus), achieving a similar 3-1 victory. With consistent wins, they are likely heading into finals at the end of the term.<\/p>\n<p>ACC Year 10 Soccer – The Year 10 soccer team competed against St. Bernard’s at St. Bernard’s College, resulting in a hard-fought 4-1 loss.<\/p>\n<p>ACC Senior B Soccer – The senior B soccer team faced Mazenod at Salesian College (Mannix Campus). Despite knowing it would be a tough match, they played well but lost with a final score of 3-0.<\/p>\n<p>ACC Senior A Soccer – The senior A soccer team played against Mazenod at Gardiners Reserve Synthetic, competing for the Davie-Egan Cup. Despite support from Carl Egan, they couldn’t secure victory, with Mazenod winning 5-3.<\/p>\n<p><strong>Badminton<br>\n<\/strong>ACC Junior Badminton<br>\nThe junior team competed against Whitefriars at Mt Waverley Badminton Centre. Despite previous losses to Whitefriars, they made adjustments and secured a win, with a final score of 10 matches and 27 sets to 2 matches and 9 sets.<\/p>\n<p>ACC Intermediate Badminton<br>\nThe intermediate team played against De La Salle at De La Salle Gym. Despite expecting a tough game, they dominated with a final score of 12 matches and 36 sets to 0 matches and 0 sets.<\/p>\n<p>ACC Senior Badminton<br>\nThe senior team faced St. Joseph’s FTG at Beyond Badminton Centre, aiming for a top-two finish. They performed well, securing a strong win with a final score of 34 sets and 12 matches to St. Joseph’s FTG’s 2 sets and 0 matches.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Football ACC Year 7 Football The Year 7 football team took on  St Joseph’s FTG at St Joseph’s FTG. The boys knew it was going to be a tough match against a very strong school. However, they didn’t perform as well as they would have wanted. The final score was 185 to 8. ACC Year&#8230;<\/p>\n","protected":false},"author":2,"featured_media":25779,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[47],"tags":[258,2130,2131,2129,2042],"acf":[],"_links":{"self":[{"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/posts\/25793"}],"collection":[{"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/comments?post=25793"}],"version-history":[{"count":0,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/posts\/25793\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/media\/25779"}],"wp:attachment":[{"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/media?parent=25793"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/categories?post=25793"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.salesian.vic.edu.au\/wp-json\/wp\/v2\/tags?post=25793"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}